# review_author: Blackperl
# review_date: 2024-12-11
# review_report_url: https://cloud.google.com/blog/topics/threat-intelligence/apt41-initiates-global-intrusion-campaign-using-multiple-exploits
# review_rule_useful: Yes
# review_rule_classification: Proceed to testing
# review_rule_ttp_match: Yes
# review_notes: The rule detects HTTP requests attempting to download the fuc payload, linked to activity targeting Cisco RV320 routers. It leverages Cisco AAA logs, looking for specific HTTP headers and methods (e.g., Host, GET, User-Agent). The logic and schema are accurate, and the provided reference supports the detection's context.

title: APT41 Cisco Router Exploitation - Payload Download Attempt
id: ed3ad8a8-3639-4cd7-bba7-be4c5e476efe
status: experimental
description: Detects HTTP requests attempting to download the 'fuc' payload associated with APT41 activity targeting Cisco RV320 routers.
references:
  - https://cloud.google.com/blog/topics/threat-intelligence/apt41-initiates-global-intrusion-campaign-using-multiple-exploits
author: System Two Security
date: 2024/11/28
tags:
  - attack.execution
logsource:
  product: cisco
  service: aaa
detection:
  selection:
    keywords|contains|all:
      - 'Host: 66.42.98.220'
      - GET /test/fuc
      - 'User-Agent: Wget'
  condition: selection
falsepositives:
  - Legitimate use of wget to download files from the specified URL.
level: critical
