# review_author: Blackperl
# review_date: 2024-12-11
# review_report_url: https://unit42.paloaltonetworks.com/muddled-libra-evolution-to-cloud
# review_rule_useful: Yes
# review_rule_classification: Proceed to testing
# review_rule_ttp_match: Yes
# review_notes: This Sigma rule detects API calls to AWS Secrets Manager for retrieving or enumerating secrets, which may signal reconnaissance or lateral movement activities. Security teams should review such actions for legitimacy, especially if originating from unusual users or locations.


title: AWS Secrets Manager Reconnaissance
id: 39ef7e3c-ae44-4530-9c49-72c60a973a20
status: experimental
description: Detects AWS Secrets Manager API calls used for reconnaissance, potentially indicating malicious activity.  Focuses on calls that retrieve secret values.
references:
  - https://unit42.paloaltonetworks.com/muddled-libra-evolution-to-cloud
author: System Two Security
date: 2024/11/29
tags:
  - attack.lateral-movement
  - attack.t1555.006
logsource:
  product: aws
  service: cloudtrail
detection:
  selection:
    eventName:
      - GetSecretValue
      - DescribeSecret
      - ListSecrets
  condition: selection
falsepositives:
  - Legitimate administrative access to AWS Secrets Manager.
  - Automated scripts for managing secrets.
level: high
