# review_report_url: https://permiso.io/blog/exploiting-hosted-models
# review_date: 2024-11-18
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - The Sigma rule "Detection of ListFoundationModels API Call in AWS CloudTrail" is designed to detect the usage of the ListFoundationModels API in AWS Bedrock, which may indicate reconnaissance activity. This activity aligns with the attack.reconnaissance phase, as attackers could use the API to enumerate available foundation models within the environment. While the rule is technically accurate, false positives can arise due to legitimate usage by authorized users or applications for administrative or operational tasks. To ensure effective detection, this rule should be used in conjunction with baseline activity monitoring to distinguish between normal and suspicious API usage patterns.

title: Detection of ListFoundationModels API Call in AWS CloudTrail
id: eb77cac5-4536-43bf-80d7-ed5b86ded080
status: experimental
description: Detects the usage of the ListFoundationModels API call in AWS CloudTrail logs, which may indicate an attempt to enumerate available foundation models in the AWS Bedrock service.
references:
  - https://permiso.io/blog/exploiting-hosted-models
author: System Two Security
date: 2024/10/03
tags:
  - attack.reconnaissance
logsource:
  service: cloudtrail
  product: aws
detection:
  selection:
    eventName: ListFoundationModels
    eventSource: bedrock.amazonaws.com
  condition: selection
falsepositives:
  - Legitimate use of the ListFoundationModels API by authorized users or applications
level: medium
