# review_report_url: https://www.mandiant.com/sites/default/files/2022-02/rt-apt41-dual-operation.pdf
# review_date: 2024-11-03
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This Sigma rule identifies spear-phishing attempts by detecting specific email subjects used by APT41 in campaigns against a European bitcoin exchange. It focuses on AWS CloudTrail logs for potentially malicious email-sending activities.
title: APT41 Spear-Phishing Email Detection
id: ba086690-193d-41fa-baba-ca223168a0e6
status: experimental
description: Detects spear-phishing emails with a specific subject line used by APT41 in targeting a European bitcoin exchange.
references:
  - https://www.mandiant.com/sites/default/files/2022-02/rt-apt41-dual-operation.pdf
author: System Two Security
date: 2024/10/25
tags:
  - attack.initial-access
logsource:
  product: aws
  service: cloudtrail
detection:
  selection:
    eventName: SendEmail
    requestParameters:
      subject: 项项 (FairWin) 项项项项 !
  condition: selection
falsepositives:
  - Legitimate emails with a subject line that coincidentally matches the indicators of compromise
level: high
