# review_author: Blackperl
# review_date: 2024-12-11
# review_report_url: https://unit42.paloaltonetworks.com/muddled-libra-evolution-to-cloud
# review_rule_useful: Yes
# review_rule_classification: Proceed to testing
# review_rule_ttp_match: Yes
# review_notes: This Sigma rule detects the creation of an AWS Transfer Family server, a potential tactic used by Muddled Libra for data exfiltration. While legitimate usage exists, alerts should be reviewed for unusual activity or unauthorized actions.

title: Muddled Libra AWS Transfer Server Creation
id: 9411230c-d415-4067-a24e-e713f834ed75
status: experimental
description: Detects the creation of an AWS Transfer server, a technique used by Muddled Libra for data exfiltration.
references:
  - https://unit42.paloaltonetworks.com/muddled-libra-evolution-to-cloud
author: System Two Security
date: 2024/11/29
tags:
  - attack.exfiltration
  - attack.t1537
logsource:
  product: aws
  service: cloudtrail
detection:
  selection:
    eventName: CreateServer
  condition: selection
falsepositives:
  - Legitimate use of AWS Transfer service
level: medium
