# review_report_url: https://permiso.io/blog/exploiting-hosted-models
# review_date: 2024-11-17
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: duplicate
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This sigma has the same detection as rule ID: 44d5e2ce-3266-4343-82f0-2de512e71e43.
title: Detection of GetFoundationModelAvailability API Call
id: e20c4861-5928-4b8e-8cd7-61468ce5336c
status: experimental
description: Detects the usage of the GetFoundationModelAvailability API call in AWS CloudTrail logs, which may indicate an attempt to leverage exposed access keys for malicious purposes.
references:
  - https://permiso.io/blog/exploiting-hosted-models
author: System Two Security
date: 2024/10/03
tags:
  - attack.discovery
logsource:
  product: aws
  service: cloudtrail
detection:
  selection:
    eventName: GetFoundationModelAvailability
    eventSource: bedrock.amazonaws.com
  condition: selection
falsepositives:
  - Legitimate use of the GetFoundationModelAvailability API by authorized users or applications
level: medium
