# review_report_url: https://redcanary.com/blog/threat-detection/email-forwarding-rules
# review_date: 2024-11-18
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This Sigma rule monitors AWS CloudTrail logs for activity involving the SourceIdentity attribute, specifically during AssumeRole and GetCallerIdentity API events. The SourceIdentity attribute is a critical tracking mechanism in AWS, enabling defenders to trace actions back to the original user or identity, even through multiple role pivots.By focusing on the AssumedRole user type and identifying when SourceIdentity appears in request parameters, this rule highlights activity that may signify unauthorized role assumption or anomalous behavior within AWS environments.

title: Detect AWS User Activity with SourceIdentity Attribute
id: 7cef75fe-6f30-4796-b564-f1b4747b0970
status: experimental
description: Detects the use of the SourceIdentity attribute in AWS CloudTrail logs, which can be used to track specific actions taken by users.
references:
  - https://redcanary.com/blog/threat-detection/email-forwarding-rules
author: System Two Security
date: 2024/11/26
tags:
  - attack.persistence
logsource:
  service: cloudtrail
  product: aws
detection:
  selection:
    eventName|contains:
      - GetCallerIdentity
      - AssumeRole
    userIdentity.type: AssumedRole
    requestParameters.attribute|contains: SourceIdentity
  condition: selection
falsepositives:
  - Legitimate use of SourceIdentity attribute by authorized personnel
level: low
