# review_report_url: https://permiso.io/blog/exploiting-hosted-models
# review_date: 2024-11-18
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - The Sigma rule "Detection of InvokeModelWithResponseStream API Call" monitors for potential misuse of AWS Bedrock services by detecting invocations of the InvokeModelWithResponseStream API, which could indicate reconnaissance or exploitation of exposed credentials. While the rule is accurate in identifying suspicious activity, the assigned tag attack.credential-access is not entirely appropriate, as the activity described in the CTI report involves abusing existing exposed credentials, not acquiring or escalating them. A more suitable tag would be attack.discovery, reflecting the attackers’ intent to probe resources and gather information. This adjustment ensures the rule aligns with the observed behaviors and provides better contextual clarity for detection frameworks.
# review_tags:fixed.manual
title: Detection of InvokeModelWithResponseStream API Call
id: 999f516d-dc01-48e5-8fda-f629e8184413
status: experimental
description: Detects the invocation of the InvokeModelWithResponseStream API which could indicate malicious activity or unauthorized access to AWS Bedrock services.
references:
  - https://permiso.io/blog/exploiting-hosted-models
author: System Two Security
date: 2024/10/03
tags:
  - attack.discovery
logsource:
  product: aws
  service: cloudtrail
detection:
  selection:
    eventName: InvokeModelWithResponseStream
    eventSource: bedrock.amazonaws.com
    eventType: AwsApiCall
  condition: selection
falsepositives:
  - Legitimate use of the InvokeModelWithResponseStream API by authorized users or applications
level: high