# review_author: Blackperl
# review_date: 2024-12-11
# review_report_url: https://www.microsoft.com/en-us/security/blog/2023/10/25/octo-tempest-crosses-boundaries-to-facilitate-extortion-encryption-and-destruction
# review_rule_useful: Yes
# review_rule_classification: Proceed to testing
# review_rule_ttp_match: Yes
# review_notes: This detection rule monitors privileged role elevations in Azure AD/Microsoft Entra without a justification, which may indicate a violation of organizational policy or an attempt to escalate privileges without accountability. While legitimate scenarios or oversights may occur, such cases should be reviewed against policy requirements. Implementing strict controls and enforcing justification for role activation can reduce risks associated with unauthorized or unexplained privilege escalation.

title: Privileged Role Elevation Without Justification
id: cd6a4d0e-2453-414f-b622-3be557a357b5
status: experimental
description: Detects privileged role elevations in Azure AD/Microsoft Entra without a justification or ticket number when it is required by organizational policy.
references:
  - https://www.microsoft.com/en-us/security/blog/2023/10/25/octo-tempest-crosses-boundaries-to-facilitate-extortion-encryption-and-destruction
author: System Two Security
date: 2024/11/28
tags:
  - attack.privilege-escalation
logsource:
  product: azure
  service: auditlogs
detection:
  selection:
    OperationName: Activate role
    ActivityDisplayName: Activate role
  filter:
    TargetResources.ModifiedProperties.NewValue|contains: justification":""
  condition: selection and filter
falsepositives:
  - Legitimate role elevations where justification is not required or was overlooked.
  - Modifications to role properties other than justification that might contain similar strings.
level: medium
