# review_author: Blackperl
# review_date: 2024-12-11
# review_report_url: https://www.microsoft.com/en-us/security/blog/2023/10/25/octo-tempest-crosses-boundaries-to-facilitate-extortion-encryption-and-destruction
# review_rule_useful: Yes
# review_rule_classification: Proceed to testing
# review_rule_ttp_match: Yes
# review_notes: This detection rule identifies unusual user password resets on Azure Virtual Machines, which could indicate malicious activity aimed at establishing persistence. While legitimate administrative actions can trigger false positives, unexpected or frequent resets should be investigated. Regularly auditing password reset activities and correlating them with user behavior can help mitigate unauthorized access risks.

title: Unusual Azure VM User Password Reset
id: 47eccb19-6f15-4d52-b8da-6322a8539e43
status: experimental
description: Detects unusual patterns of user password resets within Azure Virtual Machines, potentially indicating malicious activity.
references:
  - https://www.microsoft.com/en-us/security/blog/2023/10/25/octo-tempest-crosses-boundaries-to-facilitate-extortion-encryption-and-destruction
author: System Two Security
date: 2024/11/28
tags:
  - attack.persistence
  - attack.t1098.001
logsource:
  product: azure
  service: auditlogs
detection:
  selection:
    OperationName: Microsoft.Compute/virtualMachines/resetPassword/action
  condition: selection
falsepositives:
  - Legitimate administrative password resets
level: medium
