# review_author: Blackperl
# review_date: 2024-12-11
# review_report_url: https://www.microsoft.com/en-us/security/blog/2023/10/25/octo-tempest-crosses-boundaries-to-facilitate-extortion-encryption-and-destruction
# review_rule_useful: Yes
# review_rule_classification: Proceed to testing
# review_rule_ttp_match: Yes
# review_notes: This detection rule identifies the assignment of the User Access Administrator role with Tenant Root Group scope, a high-risk action that may indicate an attempt at privilege escalation. While legitimate administrative actions can trigger this alert, such assignments should be rare and carefully reviewed for necessity and authorization. Enforcing strict access controls and regularly auditing role assignments help mitigate risks associated with excessive permissions at the tenant level

title: Azure User Access Administrator Role Assignment with Tenant Root Group Scope
id: b81b46ca-1dfd-4048-a2a7-2a339fa9f34f
status: experimental
description: Detects the assignment of the User Access Administrator role with Tenant Root Group management scope, which could indicate privilege escalation.
references:
  - https://www.microsoft.com/en-us/security/blog/2023/10/25/octo-tempest-crosses-boundaries-to-facilitate-extortion-encryption-and-destruction
author: System Two Security
date: 2024/11/28
tags:
  - attack.privilege-escalation
logsource:
  product: azure
  service: auditlogs
detection:
  selection:
    OperationName: Add member to role
    ActivityDisplayName: Add member to role
    TargetResources.ModifiedProperties.DisplayName|contains: User Access Administrator
    TargetResources.ModifiedProperties.NewValue|contains: /tenantRootGroup
  condition: all of selection
falsepositives:
  - Legitimate administrative actions assigning the User Access Administrator role with Tenant Root Group scope.
level: high
