# review_report_url: https://unit42.paloaltonetworks.com/phishing-platform-sniper-dz-unique-tactics/
# review_date: 2024-09-21
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - The sigma rule is well mapped with the CTI report, as this is looking for the URI which is involved in credential exfiltration, grabibng password and email fields are also mapped for better detection
title: Centralized Credential Exfiltration to Sniper Dz Infrastructure
id: aa429349-9b5c-40dd-a55f-9fd5a3b8b3f5
status: experimental
description: Detects the exfiltration of stolen credentials to a centralized infrastructure controlled by Sniper Dz, specifically to the endpoint raviral.com/k_fac.php with POST parameters for email and password.
references:
  - https://unit42.paloaltonetworks.com/phishing-platform-sniper-dz-unique-tactics
author: System Two Security
date: 2024/09/26
tags:
  - attack.exfiltration
logsource:
  product: modsecurity
  category: application
detection:
  selection:
    c-uri|contains: /k_fac.php
    cs-method: POST
    c-host|contains: raviral.com
    cs-uri-query|contains|all:
      - pass=
      - email=
  condition: selection
falsepositives:
  - Legitimate POST requests to similar endpoints not related to Sniper Dz infrastructure
level: high
