# review_report_url:https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/diving-deeper-into-the-kaseya-vsa-attack-revil-returns-and-other-hackers-are-riding-their-coattails/
# review_date: 2024-11-06
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - Sigma rule to detect the creation of an assigned scheduled task called "Updater," which LATRODECTUS uses for persistent locales. It's looking for Event ID 106 from the Windows Task Scheduler and will mark any tasks having that specific name. False positives are likely if a proper one is using it. Severity: High.
title: Detection of Cobalt Strike Beacon Using Specific User-Agent
id: 714295b9-8c06-425b-b09d-12807f82d76f
status: experimental
description: Detects network connections with a specific User-Agent string indicative of Cobalt Strike beacon activity as reported in the Kaseya VSA attack.
references:
  - https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/diving-deeper-into-the-kaseya-vsa-attack-revil-returns-and-other-hackers-are-riding-their-coattails
author: System Two Security
date: 2024/10/25
tags:
  - attack.command-and-control
logsource:
  product: zeek
  service: http
detection:
  selection:
    client_header_names|contains: User-Agent
    method:
      - GET
      - POST
  filter:
    client_header_names|contains: Mozilla/5.0 (compatible; MSIE 9.0; Windows NT 6.1; Win64; x64; Trident/5.0; MANM; MANM)
  condition: selection and filter
falsepositives:
  - Legitimate use of the User-Agent string by authorized penetration testing tools or security assessments
level: high
