# review_report_url: https://any.run/cybersecurity-blog/brute-ratel-c4-analysis
# review_date: 2024-11-06
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This Sigma rule detects the execution of the `systeminfo` command, which attackers commonly use to gather details about the system configuration. Although this command can indicate malicious intent, it may also be used during legitimate administrative activities.
title: Brute Ratel C4 Badger Memory-Only Implant
id: 5fe3723f-021d-46fc-aa99-2f1e23b10409
status: experimental
description: Detects the use of Brute Ratel C4 Badger memory-only implant which uses Sleep API to maintain persistence and CreateRemoteThread for process injection.
references:
  - https://any.run/cybersecurity-blog/brute-ratel-c4-analysis
author: System Two Security
date: 2024/10/25
tags:
  - attack.persistence
logsource:
  product: windows
  category: create_remote_thread
detection:
  selection:
    TargetProcessId|endswith: FFFFFFFFFFFFFFFF
    StartFunction|contains: Sleep
    StartAddress|contains: VirtualAllocEx
    StartModule|contains: WriteProcessMemory
  condition: selection
falsepositives:
  - Legitimate use of CreateRemoteThread by trusted applications
level: high
