# review_report_url: https://www.splunk.com/en_us/blog/security/darkside-ransomware-splunk-threat-update-and-detections.html
# review_date: 2024-11-04
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - The sigma rule can be confidently deployed to monitor potential ransomware activity based on the process termination behavior linked to DarkSide. The high alert level is appropriate, given the significant impact of stopping these processes. 
title: Detection of DarkSide Ransomware Process Termination Activity
id: eb63fde4-0321-4904-bd77-cbdcdddc2390
status: experimental
description: Detects the termination of processes related to database and office applications, which is indicative of DarkSide ransomware activity.
references:
  - https://www.splunk.com/en_us/blog/security/darkside-ransomware-splunk-threat-update-and-detections.html
author: System Two Security
date: 2024/10/25
tags:
  - attack.impact
logsource:
  product: windows
  category: process_termination
detection:
  selection:
    Image|contains:
      - notepad
      - excel
      - winword
      - sqlcoreservice
      - outlook
      - powerpnt
      - oracle
  condition: selection
falsepositives:
  - Legitimate administrative activity that involves stopping office or database processes.
level: high
