# review_report_url: https://blog.lumen.com/derailing-the-raptor-train/
# review_date: 2024-10-07
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - The Sigma rule effectively detects malicious TLS certificates with random alphanumeric domains in the subject and issuer fields, a technique used by the Raptor Train campaign to obscure its Command and Control (C2) infrastructure. The CTI report describes how Tier 2 C2 servers in this campaign utilize TLS certificates with randomized domains, like cxmxb.com, to encrypt communications with compromised devices over port 443. This behavior aligns precisely with the Sigma rule, which searches for such certificates, providing a crucial detection mechanism to uncover hidden C2 communications.

title: Detection of Malicious TLS Certificate with Alphanumeric Domain
id: 986a0691-5b72-49a3-a552-9fa2d2c3f66b
status: experimental
description: Detects TLS certificates with random alphanumeric domains in the subject and issuer fields, which may indicate a C2 server.
references:
  - https://blog.lumen.com/derailing-the-raptor-train
author: System Two Security
date: 2024/10/02
tags:
  - attack.command-and-control
logsource:
  product: zeek
  service: x509
detection:
  selection:
    certificate.serial|contains: CN=
  condition: selection
falsepositives:
  - Legitimate self-signed certificates with non-standard naming conventions
level: high
