# review_report_url: https://unit42.paloaltonetworks.com/threat-assessment-north-korean-threat-groups-2024/
# review_date: 2024-10-27
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This Sigma rule identifies DNS queries to relysudden[.]com, a command-and-control domain associated with the Fullhouse Backdoor malware, by monitoring Zeek DNS logs. It triggers when a system attempts to resolve the domain, indicating possible C2 communication. False positives may arise if the domain is repurposed for legitimate use after the threat report was issued.
title: Detection of Fullhouse Backdoor Domain Activity
id: 24df566b-4101-4ed3-ab84-89ad02fd3d95
status: experimental
description: Detects network connections to known Fullhouse Backdoor command and control domains.
references:
  - https://unit42.paloaltonetworks.com/threat-assessment-north-korean-threat-groups-2024
author: System Two Security
date: 2024/09/13
tags:
  - attack.command-and-control
logsource:
  product: zeek
  service: dns
detection:
  selection:
    query|contains: relysudden[.]com
  condition: selection
falsepositives:
  - Legitimate connections to the domain, if the domain is hijacked or reused for legitimate purposes after the report.
level: high
