# review_report_url: https://unit42.paloaltonetworks.com/threat-assessment-north-korean-threat-groups-2024/
# review_date: 2024-10-27
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This Sigma rule detects DNS queries for rentedpushy.com, a domain linked to the Fullhouse Backdoor malware utilized by North Korean threat actors. If matched, it indicates potential command-and-control activity related to this backdoor. False positives could arise if the domain is repurposed or legitimately reused, so validation of the domain’s current ownership is advised.
title: Detection of Fullhouse Backdoor Domain IOC
id: 03fecc3c-b877-4030-a4e3-f60424a57f39
status: experimental
description: Detects network connections to a known malicious domain associated with the Fullhouse Backdoor used by North Korean threat groups.
references:
  - https://unit42.paloaltonetworks.com/threat-assessment-north-korean-threat-groups-2024
author: System Two Security
date: 2024/09/13
tags:
  - attack.command-and-control
logsource:
  product: zeek
  service: dns
detection:
  selection:
    query|contains: contortonset.com
  condition: selection
falsepositives:
  - Legitimate connections to the domain if it has been hijacked or reused for legitimate purposes after the report.
level: high
