# review_report_url: URL
# review_date: 2024-09-19
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - The sigma rule correctly identifies the network traffic (zeek) towards non standard port as mentioned in the CTI report
title: Detect Emotet C2 Traffic on Nonstandard Port
id: a8592372-ccb8-4e2e-a856-9785d4d971b9
status: experimental
description: Detects potential Command and Control (C2) traffic generated by Emotet malware communicating over a nonstandard port, which is indicative of malicious activity.
references:
  - https://www.welivesecurity.com/2023/07/06/whats-up-with-emotet
author: System Two Security
date: 2024/09/14
tags:
  - attack.command-and-control
logsource:
  product: zeek
  service: dns
detection:
  c2_traffic:
    id.resp_p: '7080'
  condition: c2_traffic
falsepositives:
  - Legitimate applications using the nonstandard port 7080
level: high
