# review_report_url: https://blog.talosintelligence.com/threat-actors-using-macropack/
# review_date: 2024-10-08
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This Sigma rule detects a specific Pakistan military-themed malicious file using its SHA256 hash. The rule accurately corresponds to the CTI report, targeting a known malicious document mentioned under "Theme 2". The detection logic is straightforward and precise, using a single SHA256 hash in the selection criteria
title: Detection of Allotment of Plots, Pakistan Military Themed Malicious File
id: e5e56b96-4940-4cc9-a2d7-a58c478a98e3
status: experimental
description: Detects the creation, modification, or execution of a file with a specific hash related to a Pakistan military themed malicious document.
references:
  - https://blog.talosintelligence.com/threat-actors-using-macropack
author: System Two Security
date: 2024/10/03
tags:
  - attack.initial-access
logsource:
  product: windows
  category: file_executable_detected
detection:
  selection:
    sha256: b5608e73eb460944d9b523a940d94c95d3eb66d6a8efe82462e2589ccfaadb82
  condition: selection
falsepositives:
  - Unknown. Hashes are unique to files, and false positives are unlikely but possible in the case of hash collisions or legitimate files sharing the same hash.
level: high
