# review_report_url: https://unit42.paloaltonetworks.com/threat-assessment-north-korean-threat-groups-2024/
# review_date: 2024-10-27
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This detection rule targets DNS queries for the domain swissborg.blog, identified as an indicator of compromise linked to North Korean threat groups. Utilizing Zeek's DNS service logging, the rule aims to flag potentially malicious activity indicative of command-and-control communications. However, it also recognizes the possibility of legitimate DNS queries to this domain if it is being used for non-malicious purposes, thus highlighting the need for careful analysis of flagged instances.
title: Detection of Domain swissborg.blog in DNS Queries
id: 8bbee199-2198-4edc-888f-e96799e0622d
status: experimental
description: Detects DNS queries for the domain swissborg.blog which is an indicator of compromise associated with North Korean threat groups.
references:
  - https://unit42.paloaltonetworks.com/threat-assessment-north-korean-threat-groups-2024
author: System Two Security
date: 2024/09/13
tags:
  - attack.command-and-control
logsource:
  product: zeek
  service: dns
detection:
  selection:
    query|contains: swissborg.blog
  condition: selection
falsepositives:
  - Legitimate DNS queries to the domain if it is used for benign purposes
level: high
