# review_report_url: https://www.welivesecurity.com/en/eset-research/cosmicbeetle-steps-up-probation-period-ransomhub/
# review_date: 2024-09-22
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This Sigma rule detects the termination of Project1.exe, a process associated with ScRansom variants used in malware attacks. False positives could arise from legitimate software or benign processes using the same name, requiring further analysis.
title: Detection of Project1.exe Process Termination
id: dc130c17-09c9-4155-8bf1-cf130c3c720d
status: experimental
description: Detects the termination of the Project1.exe process, which is associated with ScRansom variants.
references:
  - https://www.welivesecurity.com/en/eset-research/cosmicbeetle-steps-up-probation-period-ransomhub
author: System Two Security
date: 2024/09/28
tags:
  - attack.defense-evasion
logsource:
  product: windows
  category: process_termination
detection:
  selection:
    Image|endswith: \Project1.exe
  condition: selection
falsepositives:
  - Legitimate termination of a benign process with the same name
level: high
