# review_report_url: https://www.microsoft.com/en-us/security/blog/2023/10/18/multiple-north-korean-threat-actors-exploiting-the-teamcity-cve-2023-42793-vulnerability/
# review_date: 2024-10-27
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This rule detects network connections to a malicious staging URL that serves the feedmd.zip file, linked to the Diamond Sleet campaign. It triggers an alert when any HTTP request contains a URI that matches /themes/classic/modules/ps_rssfeed/feedmd.zip, indicating potential malware download activity. False positives may arise if the domain hosting the URL is reclaimed by its legitimate owner for benign purposes.
title: Detection of Staging URL for readme.md
id: a872b939-58b1-4a8b-a492-339074b6927c
status: experimental
description: Detects network connections to a known malicious staging URL used for downloading readme.md, which is part of the Diamond Sleet campaign.
references:
  - https://www.microsoft.com/en-us/security/blog/2023/10/18/multiple-north-korean-threat-actors-exploiting-the-teamcity-cve-2023-42793-vulnerability
author: System Two Security
date: 2024/10/25
tags:
  - attack.resource-development
logsource:
  product: zeek
  service: http
detection:
  selection:
    uri|contains: /themes/classic/modules/ps_rssfeed/feedmd.zip
  condition: selection
falsepositives:
  - Legitimate access to the compromised domain, if it has been reclaimed by the owner.
level: high
