# review_report_url:https://unit42.paloaltonetworks.com/snipbot-romcom-malware-variant
# review_date: 2024-09-21
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - The rule triggers on DNS queries to a predefined list of domain names linked to SnipBot activity. The detection condition is based solely on the presence of these domain names in the DNS queries.
title: Detection of SnipBot C2 and Staging Domain Activity
id: bb310d4d-fbd7-461c-81ad-83cb34827f99
status: experimental
description: Detects DNS queries to known C2 (Command and Control) and staging domains associated with the SnipBot malware variant.
references:
  - https://unit42.paloaltonetworks.com/snipbot-romcom-malware-variant
author: System Two Security
date: 2024/09/26
tags:
  - attack.command-and-control
  - attack.t1583.002
logsource:
  product: windows
  service: dns-client
detection:
  QueryName:
    - drvmcprotect.com
    - linedrv.com
    - drv2ms.com
    - publicshare.link
    - fileshare.direct
    - cloudcreative.digital
    - mcprotect.cloud
    - dns-msn.com
    - docstorage.link
    - fastshare.click
    - olminx.com
    - cethernet.com
    - certifysop.com
    - ilogicflow.com
    - xeontime.com
    - sitepanel.top
    - webtimeapi.com
  condition: QueryName
falsepositives:
  - Legitimate connections to domains that have been reused after being associated with SnipBot.
level: high
