# review_report_url: https://www.cisa.gov/sites/default/files/2023-07/aa23-158a-stopransomware-cl0p-ransomware-gang-exploits-moveit-vulnerability_8.pdf
# review_date: 2024-10-26
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This query is useful and correct based on the report. No fine-tuned or suggested query required.

title: Detection of LEMURLOOT ASPX Webshell
id: 7bdda0ac-7198-4cf4-bf60-ff04bf1105d8
status: experimental
description: Detects the compiled DLLs generated from human2.aspx LEMURLOOT payloads with a specific SHA256 hash.
references:
  - https://www.cisa.gov/sites/default/files/2023-07/aa23-158a-stopransomware-cl0p-ransomware-gang-exploits-moveit-vulnerability_8.pdf
author: System Two Security
date: 2024/10/25
tags:
  - attack.persistence
  - attack.t1505.003
logsource:
  product: windows
  category: file_executable_detected
detection:
  selection:
    sha256|contains: c58c2c2ea608c83fad9326055a8271d47d8246dc9cb401e420c0971c67e19cbf
  condition: selection
falsepositives:
  - Legitimate compilation of DLLs with the same hash if the file is used in a benign context.
level: high
