# review_report_url: https://www.microsoft.com/en-us/security/blog/2023/10/18/multiple-north-korean-threat-actors-exploiting-the-teamcity-cve-2023-42793-vulnerability/
# review_date: 2024-10-27
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This rule detects network connections to the malicious URL bandarpowder.com/public/assets/img/user64.png, known for staging the Forest64.exe malware. It triggers an alert if a Host header matches bandarpowder.com and the URI contains /public/assets/img/user64.png, flagging potential malicious downloads. False positives might occur if the domain is later repurposed for legitimate uses.
title: Detection of Staging URL for Forest64.exe
id: b7af08e5-5fa1-4399-b5f0-b8567b5e3738
status: experimental
description: Detects network connections to a known malicious URL used for staging the Forest64.exe malware.
references:
  - https://www.microsoft.com/en-us/security/blog/2023/10/18/multiple-north-korean-threat-actors-exploiting-the-teamcity-cve-2023-42793-vulnerability
author: System Two Security
date: 2024/10/25
tags:
  - attack.execution
logsource:
  product: zeek
  service: http
detection:
  selection1:
    uri|contains: /public/assets/img/user64.png
  selection2:
    client_header_names|contains: Host
    uri|contains: bandarpowder.com
  condition: selection1 and selection2
falsepositives:
  - Legitimate access to the URL if the domain has been reused for legitimate purposes after the report.
level: high
