# review_report_url: https://unit42.paloaltonetworks.com/threat-assessment-north-korean-threat-groups-2024/
# review_date: 2024-10-27
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This detection rule monitors DNS traffic in Zeek logs for queries to the specific IP address 146.19.173.125, which is associated with the Fullhouse Backdoor's command-and-control servers. This helps identify potential malicious activity related to North Korean threat actors. False positives could occur if the IP has been whitelisted or is used for legitimate services.
title: Detection of Fullhouse Backdoor Related IP Address
id: 327df712-bec4-47ed-a1a1-c7e690c1072e
status: experimental
description: Detects network connections to an IP address associated with the Fullhouse Backdoor used by North Korean threat groups.
references:
  - https://unit42.paloaltonetworks.com/threat-assessment-north-korean-threat-groups-2024
author: System Two Security
date: 2024/09/13
tags:
  - attack.command-and-control
logsource:
  product: zeek
  service: dns
detection:
  selection:
    query: 146.19.173.125
  condition: selection
falsepositives:
  - Legitimate connections to the IP address that have been whitelisted
level: high
