# review_report_url: https://www.microsoft.com/en-us/security/blog/2023/10/18/multiple-north-korean-threat-actors-exploiting-the-teamcity-cve-2023-42793-vulnerability/
# review_date: 2024-10-27
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This rule detects network connections to a malicious URL serving the feed.zip file, which is linked to the Diamond Sleet campaign and potentially related to the Version.dll malware. An alert is triggered when an HTTP request includes a URI containing /themes/classic/modules/ps_rssfeed/feed.zip, indicating a possible malware download attempt. False positives may occur if the URL is later accessed by legitimate applications or services after the domain is reclaimed.
title: Detection of Staging URL for Version.dll
id: d1b5a548-1598-4ed8-b374-d08c73082062
status: experimental
description: Detects network connections to a known malicious URL used as a staging URL for the Version.dll file associated with the Diamond Sleet campaign.
references:
  - https://www.microsoft.com/en-us/security/blog/2023/10/18/multiple-north-korean-threat-actors-exploiting-the-teamcity-cve-2023-42793-vulnerability
author: System Two Security
date: 2024/10/25
tags:
  - attack.command-and-control
logsource:
  product: zeek
  service: http
detection:
  selection:
    uri|contains: /themes/classic/modules/ps_rssfeed/feed.zip
  condition: selection
falsepositives:
  - Legitimate access to the URL by authorized applications or users, if the domain has been reused after the campaign.
level: high
