# review_report_url: https://blog.lumen.com/derailing-the-raptor-train/
# review_date: 2024-10-07
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - The Sigma rule matched with the CTI report. Both the rule and the report focus on the w8510.com domain and its subdomains, which serve as critical C2 infrastructure for the Oriole campaign, part of the broader Raptor Train botnet.

title: Detection of Oriole Campaign C2 Domain Activity
id: f1234e1d-2198-41ae-a777-da609f02e864
status: experimental
description: Detects DNS queries to known command and control (C2) domains associated with the Oriole campaign, which is part of the Raptor Train botnet.
references:
  - https://blog.lumen.com/derailing-the-raptor-train
author: System Two Security
date: 2024/10/02
tags:
  - attack.command-and-control
logsource:
  product: zeek
  service: dns
detection:
  query: '*w8510.com'
  condition: query
falsepositives:
  - Legitimate access to domains that have a similar naming convention but are not related to the Oriole campaign.
level: high
