# review_report_url: https://unit42.paloaltonetworks.com/threat-assessment-north-korean-threat-groups-2024/
# review_date: 2024-10-27
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This Sigma rule is designed to detect HTTP requests with the Host header set to the IP address 23.227.202.54, which is associated with the Fullhouse Backdoor command-and-control servers used by North Korean threat actors. While the detection focuses on potentially malicious network connections, there is a chance of false positives if the IP address has been repurposed for legitimate services.
title: Detection of Fullhouse Backdoor Related IP Address
id: 8b5bfb62-83d1-4a6c-85fd-2f5e0cc4f8de
status: experimental
description: Detects network connections to an IP address associated with the Fullhouse Backdoor used by North Korean threat groups.
references:
  - https://unit42.paloaltonetworks.com/threat-assessment-north-korean-threat-groups-2024
author: System Two Security
date: 2024/09/13
tags:
  - attack.command-and-control
logsource:
  product: zeek
  service: http
detection:
  selection:
    client_header_names|contains: 23.227.202.54
  condition: selection
falsepositives:
  - Legitimate connections to the IP address that have been misidentified as malicious.
level: high
