# review_report_url: https://www.pwc.co.uk/issues/cyber-security-services/research/tracking-kimsuky-north-korea-based-cyber-espionage-group-part-1.html
# review_date: 2024-10-17
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - The rule correctly detects malicious server-side paths that align with the Kimsuky group's infrastructure, as described in the CTI report. The server-side path /bbs/data/temp has been linked to multiple Kimsuky campaigns

title: Detection of Server-Side Path Indicative of Kimsuky Group Activity
id: 260d342e-bb14-474d-924d-762135ff67db
status: experimental
description: Detects the use of a server-side path "/bbs/data/temp" which has been associated with the Kimsuky cyber espionage group.
references:
  - https://www.pwc.co.uk/issues/cyber-security-services/research/tracking-kimsuky-north-korea-based-cyber-espionage-group-part-1.html
author: System Two Security
date: 2024/10/11
tags:
  - attack.command-and-control
logsource:
  category: application
  product: modsecurity
detection:
  selection:
    RequestUri|contains: /bbs/data/temp
  condition: selection
falsepositives:
  - Legitimate software or services that use a similar server-side path structure
level: high
