# review_report_url: https://blog.reveng.ai/latrodectus-distribution-via-brc4/
# review_date: 2024-11-06
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This Sigma rule detects HTTP traffic in Zeek logs that connects to known Brute Ratel C4 Badger command and control (C2) servers. Specifically, it identifies connections to domains associated with Brute Ratel activity by checking for URIs containing certain C2 domains and ports. Alerts generated by this rule indicate potential C2 communication from infected hosts, helping to identify compromised systems engaging with Brute Ratel infrastructure.
title: Detection of Brute Ratel C4 Badger C2 Activity
id: 5dee9272-01aa-4ef1-a22e-84fdee024b04
status: experimental
description: Detects network connections to known C2 servers used by Brute Ratel C4 Badger as specified in the CTI report.
references:
  - https://blog.reveng.ai/latrodectus-distribution-via-brc4
author: System Two Security
date: 2024/10/25
tags:
  - attack.command-and-control
logsource:
  product: zeek
  service: http
detection:
  c2_servers:
    uri|contains:
      - barsen.monster:7444
      - kurvabbr.pw:7444
  condition: c2_servers
falsepositives:
  - Legitimate connections to domains that are falsely re-registered for benign purposes after being taken down or abandoned by attackers.
level: high
