# review_report_url: https://blog.talosintelligence.com/threat-actors-using-macropack/
# review_date: 2024-10-08
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This Sigma rule detects the creation, modification, or execution of a file associated with the PhantomCore RAT payload. The rule is highly relevant and accurate, as it directly corresponds to the IOC provided in the CTI report. Its efficacy is strong for detecting this specific payload but limited to this exact hash.
title: Detection of PhantomCore RAT Payload
id: 8a7c47af-8e4e-49e5-b882-e51cb4876197
status: experimental
description: Detects the creation, modification, or execution of a file with a hash associated with the PhantomCore RAT.
references:
  - https://blog.talosintelligence.com/threat-actors-using-macropack
author: System Two Security
date: 2024/10/03
tags:
  - attack.persistence
logsource:
  product: windows
  category: file_executable_detected
detection:
  selection:
    sha256: 80731db97c33b50cd3d8727decec7e6a12bbf5f671527648c4cbb559fabc3074
  condition: selection
falsepositives:
  - Unknown. Hashes are unique to files, and this hash is associated with a known malicious file. Any detection should be investigated.
level: high
