# review_report_url: https://unit42.paloaltonetworks.com/threat-assessment-north-korean-threat-groups-2024/
# review_date: 2024-10-27
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This detection rule monitors HTTP traffic in Zeek logs for requests directed to a specific IP address, 198.244.135.250, associated with the Fullhouse Backdoor malware's C2 infrastructure. It flags connections where the Host header or URI field contains this IP, indicating potential communication with malicious infrastructure. Legitimate use could result in false positives if the IP is reassigned or used by benign services.
title: Detection of Fullhouse Backdoor Related IP Address
id: 7bb075fe-b283-4bae-a9c3-423d7e97c448
status: experimental
description: Detects network connections to an IP address associated with the Fullhouse Backdoor.
references:
  - https://unit42.paloaltonetworks.com/threat-assessment-north-korean-threat-groups-2024
author: System Two Security
date: 2024/09/13
tags:
  - attack.command-and-control
logsource:
  product: zeek
  service: http
detection:
  selection:
    client_header_names|contains: Host
    uri|contains: 198.244.135.250
  condition: selection
falsepositives:
  - Legitimate connections to the IP address if it has been reassigned or is used by a benign service.
level: high
