# review_report_url: https://www.trendmicro.com/en_no/research/24/i/earth-preta-new-malware-and-strategies.html
# review_date: 2024-10-07
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This Sigma rule effectively monitors HTTP requests to a WebDAV server, targeting potential malicious activities linked to Earth Preta's spear-phishing campaigns. By checking for specific URIs and HTTP status codes, it aims to identify unauthorized interactions while minimizing false positives from legitimate traffic. Continuous monitoring is crucial due to the evolving tactics employed by threat actors.

title: Detect WebDAV Server Activity Related to Earth Preta Campaign
id: adcb7a1b-f200-47f2-9820-e3189d039419
status: experimental
description: Detects network connections to a specific WebDAV server IP address used by Earth Preta in their spear-phishing campaigns for hosting decoy documents and malware samples.
references:
  - https://www.trendmicro.com/en_no/research/24/i/earth-preta-new-malware-and-strategies.html
author: System Two Security
date: 2024/10/03
tags:
  - attack.initial-access
logsource:
  product: zeek
  service: http
detection:
  selection:
    client_header_names|contains: Host
    uri|contains: /webdav/
  filter:
    status_code:
      - '404'
      - '200'
  condition: selection and filter
falsepositives:
  - Legitimate access to the WebDAV server by authorized personnel or applications
level: high
