# review_report_url:https://harfanglab.io/insidethelab/compromised-routers-infrastructure-target-europe-caucasus/
# review_date: 2024-10-26
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - The sigma rule for detecting backdoored OpenSSH version aligns with the findings in the CTI report, which specifically identifies SSH services running version 6.7p2 as indicative of compromised systems. This consistency highlights the importance of monitoring for the SSH banner SSH-2.0-OpenSSH_6.7p2 to detect potential threats associated with compromised Ubiquiti network devices.

title: Detection of Backdoored OpenSSH Version
id: ea93c5b8-f664-40fe-92f2-953d7931dfb7
status: experimental
description: Detects SSH services running a backdoored version of OpenSSH (version 6.7p2) which is indicative of compromised systems.
references:
  - https://harfanglab.io/insidethelab/compromised-routers-infrastructure-target-europe-caucasus
author: System Two Security
date: 2024/10/25
tags:
  - attack.persistence
logsource:
  product: linux
  service: sshd
detection:
  keywords: SSH-2.0-OpenSSH_6.7p2
  condition: keywords
falsepositives:
  - Legitimate use of outdated OpenSSH version on internal networks, though this is highly discouraged and should be updated.
level: high
