# review_report_url: https://www.microsoft.com/en-us/security/blog/2023/10/18/multiple-north-korean-threat-actors-exploiting-the-teamcity-cve-2023-42793-vulnerability/
# review_date: 2024-10-27
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This Sigma rule detects DNS queries for galerielamy.com, identified as a C2 domain potentially indicating system compromise. The rule targets Zeek DNS logs to catch outbound attempts to resolve this domain, flagging them as high-priority events. Analysts should check for any changes in the domain's status to avoid false positives.
title: Detection of C2 Domain galerielamy.com
id: 445ffd76-047f-4839-94f3-617e21417094
status: experimental
description: Detects network connections to the known command and control (C2) domain galerielamy.com, which may indicate a compromised system.
references:
  - https://www.microsoft.com/en-us/security/blog/2023/10/18/multiple-north-korean-threat-actors-exploiting-the-teamcity-cve-2023-42793-vulnerability
author: System Two Security
date: 2024/10/25
tags:
  - attack.command-and-control
logsource:
  product: zeek
  service: dns
detection:
  query:
    query|contains: galerielamy.com
  condition: query
falsepositives:
  - Legitimate traffic to the domain galerielamy.com if it is a false positive or has been reclaimed by legitimate owners.
level: high
