# review_report_url: https://www.microsoft.com/en-us/security/blog/2024/07/25/onyx-sleet-uses-array-of-malware-to-gather-intelligence-for-north-korea/
# review_date: 2024-09-22
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - The Sigma rule is designed to detect DNS queries or network connections to known malicious domains controlled by threat actors. The rule focuses on Zeek DNS logs and looks for specific domain names in the query field. The rule directly addresses a key aspect of the threat described in the CTI report: the use of actor-controlled domains. By monitoring DNS queries for these specific domains, it can effectively detect attempts to communicate with the actor's infrastructure. This approach is particularly useful for identifying initial access or command and control activities.
title: Detection of Actor-Controlled Domains
id: 500f43dc-7d93-4bc5-b911-0c117ae8db82
status: experimental
description: Detects DNS queries or network connections to known malicious domains controlled by threat actors.
references:
  - https://www.microsoft.com/en-us/security/blog/2024/07/25/onyx-sleet-uses-array-of-malware-to-gather-intelligence-for-north-korea
author: System Two Security
date: 2024/09/09
tags:
  - attack.t1071.004
  - attack.command-and-control
logsource:
  product: zeek
  service: dns
detection:
  selection:
    query|contains:
      - privatemake.bounceme.net
      - advice.uphearth.com
      - ww3c.bounceme.net
      - americajobmail.site
  condition: selection
falsepositives:
  - Legitimate connections to domains that have been compromised and are being used by the threat actors without the domain owner's knowledge.
level: high
