# review_report_url: https://unit42.paloaltonetworks.com/threat-assessment-north-korean-threat-groups-2024/
# review_date: 2024-10-27
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This detection rule monitors DNS queries for the domain levelframeblog.com, which is recognized as associated with the PondRAT malware used by North Korean threat groups. By leveraging Zeek's DNS service logging, this rule aims to identify potential command-and-control communications linked to this domain. The rule categorizes detected queries as high risk, while also noting the possibility of legitimate traffic to the domain, which could occur if it is hijacked or repurposed for non-malicious activities.
title: Detection of PondRAT Malicious Domain
id: cc195fa1-4be4-4cc6-b18e-48d4b3496368
status: experimental
description: Detects DNS queries for a known malicious domain associated with North Korean threat group PondRAT.
references:
  - https://unit42.paloaltonetworks.com/threat-assessment-north-korean-threat-groups-2024
author: System Two Security
date: 2024/09/13
tags:
  - attack.command-and-control
logsource:
  product: zeek
  service: dns
detection:
  selection:
    query|contains: levelframeblog[.]com
  condition: selection
falsepositives:
  - Legitimate access to the domain, if the domain is hijacked or used for legitimate purposes outside the attacker's control.
level: high
