# review_report_url: https://blog.sekoia.io/stealc-a-copycat-of-vidar-and-raccoon-infostealers-gaining-in-popularity-part-1
# review_date: 2024-12-03
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This Sigma rule detects HTTP requests to the cracked software catalogue website `rcc-software.com`, associated with the distribution of the Stealc infostealer, using Zeek HTTP logs. It is marked as high severity, with potential false positives if the domain is repurposed for legitimate use after takedown or expiration.
title: Detection of Network Connections to Cracked Software Catalogue Website
id: b334d98a-3a39-403a-9750-7ff943b04d74
status: experimental
description: Detects network connections to a known cracked software catalogue website which is associated with the distribution of the Stealc infostealer.
references:
  - https://blog.sekoia.io/stealc-a-copycat-of-vidar-and-raccoon-infostealers-gaining-in-popularity-part-1
author: System Two Security
date: 2024/11/15
tags:
  - attack.resource-development
logsource:
  product: zeek
  service: http
detection:
  selection:
    uri|contains: rcc-software.com
  condition: selection
falsepositives:
  - Legitimate access to the domain, if the domain is reused for legitimate purposes after takedown or expiration.
level: high
