# review_report_url: https://permiso.io/blog/exploiting-hosted-models
# review_date: 2024-11-18
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This Sigma rule aims at detecting web requests with a specific UserAgent string associated with LLMHijacking for RP Campaign, where it is prone to false negatives if attackers modify or spoof the UserAgent string to evade detection.

title: Detection of Axios UserAgent String Indicative of LLMHijacking
id: deee8b71-eed3-438a-b455-3e9c5019d7f2
status: experimental
description: Detects web requests with a specific UserAgent string associated with LLMHijacking for RP Campaign.
references:
  - https://permiso.io/blog/exploiting-hosted-models
author: System Two Security
date: 2024/10/03
tags:
  - attack.command-and-control
logsource:
  category: application
  product: modsecurity
detection:
  ua_string:
    UserAgent|contains: axios/1.6.1
  condition: ua_string
falsepositives:
  - Legitimate use of axios/1.6.1 by internal or external applications
level: high
