# review_report_url: https://blog.lumen.com/derailing-the-raptor-train/
# review_date: 2024-10-07
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - The Sigma rule accurately detects DNS queries to the Raptor Train campaign’s payload server at the IP address, as described in the CTI report. Both the rule and the report focus on this IP address being used in the Canary Campaign for delivering malware and payloads to compromised devices.

title: Detection of Raptor Train Campaign Payload Server
id: 548df396-7c77-4b17-a220-f15f2e8d969c
status: experimental
description: Detects network connections to a known Payload Server IP address associated with the Raptor Train Campaign.
references:
  - https://blog.lumen.com/derailing-the-raptor-train
author: System Two Security
date: 2024/10/02
tags:
  - attack.command-and-control
logsource:
  product: zeek
  service: dns
detection:
  selection:
    query: 192.248.171.10
  condition: selection
falsepositives:
  - Legitimate connections to the IP address if it has been reassigned after the campaign.
level: high
