# review_report_url: https://blog.sekoia.io/stealc-a-copycat-of-vidar-and-raccoon-infostealers-gaining-in-popularity-part-1
# review_date: 2024-12-03
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This Sigma rule detects the download of a known Stealc infostealer payload from the compromised website `streetlifegaming.com`, using Zeek HTTP logs. It is classified as high severity, with potential false positives for legitimate downloads of files with the same name or authorized testing purposes.
title: Detection of Stealc Infostealer Download
id: 0ac193d5-2b39-43f3-b27d-71b06c999295
status: experimental
description: Detects the download of a known Stealc infostealer payload from a compromised website.
references:
  - https://blog.sekoia.io/stealc-a-copycat-of-vidar-and-raccoon-infostealers-gaining-in-popularity-part-1
author: System Two Security
date: 2024/11/15
tags:
  - attack.credential-access
logsource:
  product: zeek
  service: http
detection:
  uri: streetlifegaming.com/wp-content/uploads/2023/02/Pass_55555_Setup.rar
  condition: uri
falsepositives:
  - Legitimate download of a file with the same name from a different host or for authorized testing purposes.
level: high
