# review_report_url: https://unit42.paloaltonetworks.com/threat-assessment-north-korean-threat-groups-2024/
# review_date: 2024-10-27
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This Sigma rule monitors Zeek DNS logs for any DNS queries or web proxy requests to prontoposer[.]com, a known Fullhouse Backdoor C2 domain. It alerts when any attempt to resolve this domain occurs, potentially indicating command-and-control activity associated with the Fullhouse Backdoor malware. False positives could occur if the domain is later used for legitimate purposes or repurposed by another entity after the threat report's publication.
title: Detection of Fullhouse Backdoor Domain Communication
id: 9146f723-6981-4036-9828-d180ecc8908b
status: experimental
description: Detects DNS queries or web proxy requests for a known Fullhouse Backdoor command and control domain.
references:
  - https://unit42.paloaltonetworks.com/threat-assessment-north-korean-threat-groups-2024
author: System Two Security
date: 2024/09/13
tags:
  - attack.command-and-control
logsource:
  product: zeek
  service: dns
detection:
  selection:
    query|contains: prontoposer[.]com
  condition: selection
falsepositives:
  - Legitimate access to the domain, if the domain is hijacked or reused for legitimate purposes after the report.
level: high
