# review_report_url: https://www.microsoft.com/en-us/security/blog/2023/10/18/multiple-north-korean-threat-actors-exploiting-the-teamcity-cve-2023-42793-vulnerability/
# review_date: 2024-10-27
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  -This Sigma rule monitors DNS queries for the domain 3dkit.org, a known C2 indicator, as reported in recent threat intelligence associated with North Korean threat actors. Designed for Zeek DNS logs, it flags any network connections attempting to resolve this domain, enabling rapid detection of potential compromise. Analysts should validate connections against current threat intel to minimize false positives.
title: Detection of C2 Domain 3dkit.org Activity
id: a528e208-ee2a-4ab3-9eb4-d29440804c18
status: experimental
description: Detects network connections to the known command and control (C2) domain 3dkit.org, which has been identified as an indicator of compromise.
references:
  - https://www.microsoft.com/en-us/security/blog/2023/10/18/multiple-north-korean-threat-actors-exploiting-the-teamcity-cve-2023-42793-vulnerability
author: System Two Security
date: 2024/10/25
tags:
  - attack.command-and-control
logsource:
  product: zeek
  service: dns
detection:
  query:
    query|contains: 3dkit.org
  condition: query
falsepositives:
  - Legitimate connections to the domain 3dkit.org, if it is used for benign purposes within the environment. Analysts should verify whether the domain is still considered malicious at the time of detection.
level: high
