# review_report_url: https://www.bitdefender.com/en-gb/blog/labs/unmasking-the-sys01-infostealer-threat-bitdefender-labs-tracks-global-malvertising-campaign-targeting-meta-business-pages
# review_date: 2024-12-03
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This Sigma rule is designed to detect DNS queries for domains associated with SYS01 Infostealer malware which is part of a known Meta business page campaign. The network connection detection is done for the malicious domains such as ubrosive.top and any other domain related to this malware. False positives could occur if legitimate services use such compromised domains for benign purposes.
title: Detection of SYS01 Infostealer C2 Domain Activity
id: fd99d1cc-595a-4a25-a8b5-2af200b89484
status: experimental
description: Detects network connections to known command and control (C2) domains associated with the SYS01 Infostealer malware campaign.
references:
  - https://www.bitdefender.com/en-gb/blog/labs/unmasking-the-sys01-infostealer-threat-bitdefender-labs-tracks-global-malvertising-campaign-targeting-meta-business-pages
author: System Two Security
date: 2024/11/15
tags:
  - attack.command-and-control
logsource:
  product: zeek
  service: dns
detection:
  query:
    query|contains:
      - ubrosive.top
      - untratem.top
      - ostimatu.top
      - matcrogir.top
      - musament.top
      - enorgutic.top
      - wrust.top
      - lucielarouche.com
  condition: query
falsepositives:
  - Legitimate connections to domains that have been compromised and are also used for benign purposes.
level: high
