# review_report_url: https://www.welivesecurity.com/en/eset-research/cosmicbeetle-steps-up-probation-period-ransomhub/
# review_date: 2024-09-22
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This Sigma rule detects DNS queries to the domain www.lockbitblog.info, which is linked to a fake LockBit leak site. False positives may occur if the domain is later hijacked for legitimate use, requiring verification.
title: Detection of Fake LockBit Leak Site Domain Query
id: 216a059a-1b01-474c-a1ea-ab1ec1e68877
status: experimental
description: Detects DNS queries or network connections to the domain associated with a fake LockBit leak site.
references:
  - https://www.welivesecurity.com/en/eset-research/cosmicbeetle-steps-up-probation-period-ransomhub
author: System Two Security
date: 2024/09/28
tags:
  - attack.resource-development
logsource:
  product: zeek
  service: dns
detection:
  query: www.lockbitblog.info
  condition: query
falsepositives:
  - Legitimate queries to the domain, if the domain is hijacked for legitimate purposes in the future.
level: high
