# review_report_url: https://unit42.paloaltonetworks.com/threat-assessment-north-korean-threat-groups-2024/
# review_date: 2024-10-27
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This Sigma rule detects DNS queries for contortonset.com, a domain associated with the Fullhouse Backdoor malware attributed to North Korean threat actors. If triggered, it could indicate command-and-control communication linked to Fullhouse Backdoor. However, false positives may occur if the domain is repurposed or used for legitimate activities after the initial threat report.
title: Detection of Fullhouse Backdoor Domain Communication
id: faa83279-cf6e-4cb0-8309-7edbcd0646d3
status: experimental
description: Detects DNS or web proxy log entries indicating communication with a known Fullhouse Backdoor command and control server domain.
references:
  - https://unit42.paloaltonetworks.com/threat-assessment-north-korean-threat-groups-2024
author: System Two Security
date: 2024/09/13
tags:
  - attack.command-and-control
logsource:
  product: zeek
  service: dns
detection:
  selection:
    query|contains: primerosauxiliosperu[.]com
  condition: selection
falsepositives:
  - Legitimate access to the domain, if it has been hijacked or reused for benign purposes after the report
level: high
