# review_report_url: https://unit42.paloaltonetworks.com/threat-assessment-north-korean-threat-groups-2024/
# review_date: 2024-10-27
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This detection rule identifies DNS queries to the domain jdkgradle.com, which is linked to the PondRAT malware operated by North Korean threat groups. Utilizing Zeek's DNS logging capabilities, this rule aims to flag potential command-and-control activities associated with this domain. The rule highlights that while it categorizes such queries as high risk, legitimate traffic may exist, necessitating further analysis if the domain is hijacked or repurposed for benign use.
title: Detection of PondRAT Malicious Domain
id: 427f50f4-12a6-40d7-a73e-85338a9e3e43
status: experimental
description: Detects DNS queries for a known malicious domain associated with North Korean threat group PondRAT.
references:
  - https://unit42.paloaltonetworks.com/threat-assessment-north-korean-threat-groups-2024
author: System Two Security
date: 2024/09/13
tags:
  - attack.command-and-control
logsource:
  product: zeek
  service: dns
detection:
  selection:
    query|contains: jdkgradle.com
  condition: selection
falsepositives:
  - Legitimate access to the domain, if the domain is hijacked or used for legitimate purposes after the report
level: high
