# review_report_url: https://unit42.paloaltonetworks.com/threat-assessment-north-korean-threat-groups-2024/
# review_date: 2024-10-27
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This detection rule monitors network connections to an IP address (88.119.174.148) associated with the Fullhouse Backdoor, which is linked to North Korean threat actors. Utilizing Zeek's HTTP logs, the rule aims to identify potential command-and-control (C2) communications by examining client headers. While it effectively targets known malicious traffic, there is a possibility of false positives from legitimate connections to the same IP address. Analysts are advised to investigate the context of alerts, including the nature of the traffic and associated behavior, to confirm any malicious intent.
title: Detection of Fullhouse Backdoor Related IP Address
id: 42c7d00a-ef09-492f-87c2-4057f7e07652
status: experimental
description: Detects network connections to an IP address associated with the Fullhouse Backdoor used by North Korean threat groups.
references:
  - https://unit42.paloaltonetworks.com/threat-assessment-north-korean-threat-groups-2024
author: System Two Security
date: 2024/09/13
tags:
  - attack.command-and-control
logsource:
  product: zeek
  service: http
detection:
  selection:
    client_header_names|contains: 88.119.174.148
  condition: selection
falsepositives:
  - Legitimate connections to the IP address that have been misidentified as malicious.
level: high
