# review_report_url: https://www.elastic.co/security-labs/spring-cleaning-with-latrodectus
# review_date: 2024-11-06
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This Sigma rule is intended to identify communication of a network with a domain known malicious. The malicious domain is aytobusesre.com, which connects to LATRODECTUS malware. False positives might be generated by the presence of hijacked or reused domains; hence, any detection has to be investigated for possible benign traffic.
title: LATRODECTUS Malicious Domain Communication
id: c45a9949-b3d5-43b4-906a-4ed1d399e947
status: experimental
description: Detects communication with a known malicious domain used by LATRODECTUS malware.
references:
  - https://www.elastic.co/security-labs/spring-cleaning-with-latrodectus
author: System Two Security
date: 2024/10/25
tags:
  - attack.command-and-control
logsource:
  product: windows
  category: dns_query
detection:
  selection:
    QueryName|contains: aytobusesre.com
  condition: selection
falsepositives:
  - Legitimate traffic to the domain if it has been hijacked or is a false positive.
level: high
