# review_report_url: https://www.microsoft.com/en-us/security/blog/2023/10/18/multiple-north-korean-threat-actors-exploiting-the-teamcity-cve-2023-42793-vulnerability/
# review_date: 2024-10-27
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This rule detects DNS queries linked to the Diamond Sleet APT, specifically monitoring for requests containing certain domain names, such as 3dkit.org and dersmarketim.com. An alert is generated when any of these domains are queried, indicating potential command and control (C2) activity. False positives may arise from legitimate user actions or investigations that inadvertently trigger these alerts.
title: Diamond Sleet APT DNS Communication Indicators
id: fba38e0f-4607-4344-bb8f-a4b50cdeef7f
status: experimental
description: Detects DNS queries related to Diamond Sleet APT activity
references:
    - https://www.microsoft.com/en-us/security/blog/2023/10/18/multiple-north-korean-threat-actors-exploiting-the-teamcity-cve-2023-42793-vulnerability/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/10/24
tags:
    - attack.command_and_control
    - detection.emerging_threats
logsource:
    product: windows
    category: dns_query
detection:
    selection:
        QueryName|contains:
            - '3dkit.org'
            - 'dersmarketim.com'
            - 'galerielamy.com'
            - 'olidhealth.com'
    condition: selection
falsepositives:
    - Might generate some false positive if triggered by a user during investigation for example.
level: high
