# review_report_url: https://cloud.google.com/blog/topics/threat-intelligence/apt41-us-state-governments
# review_date: 2024-11-03
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This Sigma rule detects the presence of the 'AppRouted.dll' file, associated with the 2024 StealthVector loader, by its MD5 hash. It flags executable files matching the hash, which are indicative of potential malicious activity linked to APT41's operations.
title: APT41 Reconnaissance Command Exfiltration via DNS Queries
id: 4d16c763-4a85-4bd2-8c0d-1fdc9e19396c
status: experimental
description: Detects the use of ping commands to exfiltrate the output of reconnaissance commands by appending the output to subdomains in DNS queries, a technique used by APT41.
references:
  - https://cloud.google.com/blog/topics/threat-intelligence/apt41-us-state-governments
author: System Two Security
date: 2024/10/25
tags:
  - attack.t1071.004
  - attack.exfiltration
logsource:
  product: windows
  category: dns_query
detection:
  selection:
    QueryName|contains: .ns.time12.cf
  condition: selection
falsepositives:
  - Legitimate use of subdomains with similar patterns by benign applications or scripts
level: high
