# review_report_url: https://www.microsoft.com/en-us/security/blog/2024/07/25/onyx-sleet-uses-array-of-malware-to-gather-intelligence-for-north-korea/
# review_date: 2024-09-23
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This rule directly addresses a specific aspect of the threat described in the CTI report: the use of a fake Tableau certificate. The rule focuses on Windows driver load events and looks for specific attributes associated with the fake certificate, including the signer name, signature status, and certificate hashes. 
title: Detection of Fake Tableau Certificate
id: 0fe59be7-3606-4469-8809-ea7e4b852d4c
status: experimental
description: Detects the execution of processes using a fake Tableau certificate with specific attributes such as signer, signer hash, and certificate serial number.
references:
  - https://www.microsoft.com/en-us/security/blog/2024/07/25/onyx-sleet-uses-array-of-malware-to-gather-intelligence-for-north-korea
author: System Two Security
date: 2024/09/09
tags:
  - attack.defense-evasion
logsource:
  product: windows
  category: driver_load
detection:
  selection:
    Signature|contains: INVALID:Tableau Software Inc.
    SignatureStatus: unsigned
    Signature|endswith: Tableau Software Inc.
    Hashes|contains|all:
      - 76cb5d1e6c2b6895428115705d9ac765
      - 6624c7b8faac176d1c1cb10b03e7ee58a4853f91
  condition: selection
falsepositives:
  - Legitimate software that is incorrectly signed with a certificate that matches the fake Tableau certificate attributes
level: high
