# review_author: Blackperl
# review_date: 2024-12-11
# review_report_url: https://unit42.paloaltonetworks.com/edr-bypass-extortion-attempt-thwarted
# review_rule_useful: Yes
# review_rule_classification: Proceed to testing
# review_rule_ttp_match: Yes
# review_notes: This rule detects attempts to load drivers related to the "disabler.exe" EDR evasion tool, specifically wnbios.sys and WN_64.sys. False positives are unlikely unless there are legitimate drivers with similar names, which are rare.

title: Suspicious Driver Load Attempt - EDR Evasion
id: a34d05d3-d10d-4a88-8469-a449ab734758
status: experimental
description: Detects the presence or attempted loading of drivers associated with the "disabler.exe" EDR evasion tool.
references:
  - https://unit42.paloaltonetworks.com/edr-bypass-extortion-attempt-thwarted
author: System Two Security
date: 2024/11/28
tags:
  - attack.defense-evasion
logsource:
  product: windows
  category: driver_load
detection:
  selection:
    ImageLoaded:
      - wnbios.sys
      - WN_64.sys
  condition: selection
falsepositives:
  - Legitimate drivers with similar names (unlikely)
level: high
