# review_report_url: https://www.microsoft.com/en-us/security/blog/2021/01/20/deep-dive-into-the-solorigate-second-stage-activation-from-sunburst-to-teardrop-and-raindrop/
# review_date: 2024-09-21
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - The original Sigma rule covers the file paths.
title: Detection of Custom Cobalt Strike Beacon Loader File Paths
id: d0ee9c88-ec8d-4b6f-b6cc-a37193dfb147
status: experimental
description: Detects file creation, modification, or loading events from non-standard paths associated with a custom Cobalt Strike Beacon loader.
references:
  - https://www.microsoft.com/en-us/security/blog/2021/01/20/deep-dive-into-the-solorigate-second-stage-activation-from-sunburst-to-teardrop-and-raindrop
author: System Two Security
date: 2024/09/23
tags:
  - attack.defense-evasion
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|contains|all:
      - C:\\Windows\\AppReadiness\\AppRead.dll
      - C:\\Windows\\Registration\\crmlog.dll
      - C:\\Windows\\RemotePackages\\RemoteApps\\RemPack.dll
      - C:\\Windows\\ShellExperiences\\MtUvc.dll
      - C:\\Windows\\Vss\\Writers\\Application\\AppXML.dll
      - C:\\Windows\\CbsTemp\\cbst.dll
      - C:\\Windows\\ms\\sms\\sms.dll
      - C:\\Windows\\LiveKernelReports\\KerRep.dll
      - C:\\Windows\\DigitalLocker\\lock.dll
      - C:\\Windows\\PrintDialog\\PrintDial.dll
      - C:\\Windows\\Panther\\MainQueueOnline.dll
      - C:\\Windows\\Speech_OneCore\\Engines\\TTS\\en-US\\enUS.Name.dll
      - C:\\Windows\\PCHEALTH\\health.dll
      - C:\\Windows\\AppReadiness\\Appapi.dll
      - C:\\Windows\\ELAMBKUP\\WdBoot.dll
      - C:\\Windows\\SoftwareDistribution\\DataStore\\DataStr.dll
      - C:\\Windows\\Microsoft.NET\\Framework64\\sbscmp30.dll
      - C:\\Windows\\Migration\\WTR\\ctl.dll
      - C:\\Windows\\apppatch\\apppatch64\\sysmain.dll
      - C:\\Windows\\AUInstallAgent\\auagent.dll
      - C:\\Windows\\assembly\\GAC_64\\MSBuild\\3.5.0.0__b03f5f7f11d50a3a\\msbuild.dll
      - C:\\Windows\\PrintDialog\\appxsig.dll
      - C:\\Windows\\AppPatch\\AcWin.dll
      - C:\\Windows\\ShellComponents\\TaskFlow.dll
      - C:\\Windows\\Cursors\\cursrv.dll
  condition: selection
falsepositives:
  - Legitimate software that uses the same file paths
  - System or application updates that create or modify files in the listed directories
level: high
