# review_report_url: https://blog.sekoia.io/stealc-a-copycat-of-vidar-and-raccoon-infostealers-gaining-in-popularity-part-1
# review_date: 2024-12-03
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This rule detects file system activity indicating potential data theft from Vivaldi browser user data directory \Vivaldi\User Data
title: Stealc Infostealer - Vivaldi Browser Data Theft
id: d78cf441-0520-41d2-be2d-f384f064f3e2
status: experimental
description: Detects file system activity indicating potential data theft from Vivaldi browser user data directory
references:
  - https://blog.sekoia.io/stealc-a-copycat-of-vidar-and-raccoon-infostealers-gaining-in-popularity-part-1
author: System Two Security
date: 2024/11/15
tags:
  - attack.collection
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|contains: \Vivaldi\User Data
  condition: selection
falsepositives:
  - Legitimate browser or system update process accessing the user data directory
  - Backup software accessing the user data directory
level: high
