# review_report_url: https://blog.sekoia.io/stealc-a-copycat-of-vidar-and-raccoon-infostealers-gaining-in-popularity-part-1
# review_date: 2024-12-03
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This Sigma rule access to the EpicPrivacyBrowser User Data directory, which may suggest an attempt to steal information from the browser.
title: Detection of EpicPrivacyBrowser User Data Access
id: 5e764499-d456-44eb-8d9e-7f34570692b4
status: experimental
description: Detects file system activity indicating access to the EpicPrivacyBrowser User Data directory, which may suggest an attempt to steal information from the browser.
references:
  - https://blog.sekoia.io/stealc-a-copycat-of-vidar-and-raccoon-infostealers-gaining-in-popularity-part-1
author: System Two Security
date: 2024/11/15
tags:
  - attack.collection
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|contains: \Epic Privacy Browser\User Data
  condition: selection
falsepositives:
  - Legitimate browser or system update process accessing the User Data directory
  - Backup software accessing browser profiles
level: high
