# review_report_url: https://blog.sekoia.io/stealc-a-copycat-of-vidar-and-raccoon-infostealers-gaining-in-popularity-part-1
# review_date: 2024-12-03
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This Sigma detects file system activity indicating potential theft of Pale Moon browser data by monitoring access to the specific path used by the browser to store user data.
title: Detection of Pale Moon Browser Data Theft
id: b6b868e5-fcc9-4504-9e00-25f76bca86a2
status: experimental
description: Detects file system activity indicating potential theft of Pale Moon browser data by monitoring access to the specific path used by the browser to store user data.
references:
  - https://blog.sekoia.io/stealc-a-copycat-of-vidar-and-raccoon-infostealers-gaining-in-popularity-part-1
author: System Two Security
date: 2024/11/15
tags:
  - attack.exfiltration
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|contains: \Moonchild Productions\Pale Moon\Profiles
  condition: selection
falsepositives:
  - Legitimate software or administrative tools accessing the browser profiles directory
level: high
