# review_report_url: https://www.volexity.com/blog/2021/03/02/active-exploitation-of-microsoft-exchange-zero-day-vulnerabilities/
# review_date: 2024-10-26
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - The sigma rule is properly aligned with the CTI report. It accurately detects the creation of a simple ASPX webshell, matching the pattern for <%@ Page Language="C#" %> and file-writing logic, as detailed in the CTI report. 
title: Simple ASPX Webshell File Write Activity
id: ba6fbc1f-e393-4a6c-a030-33d233c82afb
status: experimental
description: Detects a simple ASPX Webshell that allows an attacker to write further files to disk
references:
  - https://www.volexity.com/blog/2021/03/02/active-exploitation-of-microsoft-exchange-zero-day-vulnerabilities
author: System Two Security
date: 2024/10/25
tags:
  - attack.persistence
  - attack.t1505.003
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|endswith: .aspx
  keywords:
    Image|contains|all:
      - <% HttpPostedFile thisFile = Request.Files[0];thisFile.SaveAs(Path.Combine
      - <%@ Page Language="C#" %>
  condition: selection and keywords and filesize < 1024
falsepositives:
  - Legitimate administrative tools that use ASPX for file management
level: high
