# review_report_url: https://cloud.google.com/blog/topics/threat-intelligence/fin7-shim-databases-persistence
# review_date: 2024-10-18
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - The sigma rule effectively addresses the detection of FIN7's persistence tactics using shim databases. By monitoring for .tmp files created in C:\Windows\Temp, security teams can enhance their ability to identify and mitigate potential threats related to this specific attack vector. The CTI report provides valuable context, emphasizing the methodical approach FIN7 takes when deploying such persistence mechanisms.
title: FIN7 Malicious Shim Database File Creation
id: e625ecf9-89c8-45de-87ee-d3a34f2881e6
status: experimental
description: Detects the creation of a shim database file with a ".tmp" file extension in the "C:\\Windows\\Temp" directory as used by FIN7 for persistence.
references:
  - https://cloud.google.com/blog/topics/threat-intelligence/fin7-shim-databases-persistence
author: System Two Security
date: 2024/10/11
tags:
  - attack.persistence
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|endswith: \sdb*.tmp
    Image|startswith: C:\\Windows\\Temp\\
  condition: selection
falsepositives:
  - Legitimate software that uses shim databases for compatibility purposes and stores them in the temp directory, although this is uncommon.
level: high
