# review_report_url: https://blog.sekoia.io/stealc-a-copycat-of-vidar-and-raccoon-infostealers-gaining-in-popularity-part-1
# review_date: 2024-12-03
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This Sigma detects file system activity indicating potential data theft from QQBrowser user data directory \Tencent\QQBrowser\User Data
title: Stealc Infostealer - QQBrowser Data Theft
id: 5b64736f-0d54-40f9-bc60-af06d0a27aa6
status: experimental
description: Detects file system activity indicating potential data theft from QQBrowser user data directory
references:
  - https://blog.sekoia.io/stealc-a-copycat-of-vidar-and-raccoon-infostealers-gaining-in-popularity-part-1
author: System Two Security
date: 2024/11/15
tags:
  - attack.credential-access
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|contains: \Tencent\QQBrowser\User Data
  condition: selection
falsepositives:
  - Legitimate QQBrowser software update or maintenance
level: high
