# review_report_url: URL
# review_date: 2024-09-12
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - The Sigma rule accurately detects the creation of ListName_jsp.java, directly relating to the activity described in the CTI report. Therefore, sigma effectively covers the key aspect mentioned in CTI report.
title: Detection of ListName_jsp.java File Generation Prior to Log Clearing via Webshell
id: c7e16eef-ffd5-4d07-b284-964505148819
status: experimental
description: Detects the generation of a Java source file (ListName_jsp.java) which is indicative of malicious activity, specifically prior to log clearing via the selfsdp.jspx webshell.
references:
  - https://www.crowdstrike.com/blog/falcon-complete-thwarts-vanguard-panda-tradecraft
author: System Two Security
date: 2024/09/10
tags:
  - attack.persistence
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|endswith: \ListName_jsp.java
  timeframe: 1h
  condition: selection
falsepositives:
  - Legitimate compilation of JSP files that coincidentally match the naming convention
level: high
