# review_report_url:https://www.microsoft.com/en-us/security/blog/2024/04/22/analyzing-forest-blizzards-custom-post-compromise-tool-for-exploiting-cve-2022-38028-to-obtain-credentials/
# review_date: 2024-10-26
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This sigma rule, paired with the CTI report, provides robust detection capabilities against Forest Blizzard’s activities. By monitoring JavaScript file creation in DriverStore, analyzing scheduled task creation, and capturing registry manipulation events, organizations can detect and disrupt Forest Blizzard’s defense evasion and persistence tactics effectively. Regular threat intelligence updates and patching, particularly for Print Spooler vulnerabilities, remain critical to preventing such sophisticated APT attacks.

title: Forest Blizzard APT - JavaScript Constrained File Creation
id: ec7c4e9b-9bc9-47c7-a32f-b53b598da642
status: experimental
description: |
    Detects the creation of JavaScript files inside of the DriverStore directory.
    Forest Blizzard used this to exploit the CVE-2022-38028 vulnerability in Windows Print Spooler service by modifying a JavaScript constraints file and executing it with SYSTEM-level permissions.
references:
    - https://www.microsoft.com/en-us/security/blog/2024/04/22/analyzing-forest-blizzards-custom-post-compromise-tool-for-exploiting-cve-2022-38028-to-obtain-credentials/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2024/04/23
tags:
    - attack.defense_evasion
    - attack.t1562.002
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|startswith: 'C:\Windows\System32\DriverStore\FileRepository\'
        TargetFilename|endswith: '\.js'
    condition: selection
falsepositives:
    - Unlikely
level: medium
