# review_report_url: https://blog.sekoia.io/stealc-a-copycat-of-vidar-and-raccoon-infostealers-gaining-in-popularity-part-1
# review_date: 2024-12-03
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This Sigma rule detects file system activity involving the User Data directory of the CryptoTab Browser; this may be a sign that malware, such as Stealc, steal data. False positives occur when legitimate applications or administration tools access the directory.
title: Detection of CryptoTab Browser Data Theft
id: f135ab9f-5168-4939-9558-4c6a75942801
status: experimental
description: Detects file system activity indicating access to CryptoTab Browser user data, which may suggest information theft by malware such as Stealc.
references:
  - https://blog.sekoia.io/stealc-a-copycat-of-vidar-and-raccoon-infostealers-gaining-in-popularity-part-1
author: System Two Security
date: 2024/11/15
tags:
  - attack.collection
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|contains: \CryptoTab Browser\User Data
  condition: selection
falsepositives:
  - Legitimate access by authorized applications or administrative tools
level: high
