# review_report_url: https://media.defense.gov/2023/May/24/2003229517/-1/-1/0/CSA_Living_off_the_Land.PDF
# review_date: 2024-10-18
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - The Sigma rule aligns directly with the behaviors described in the CTI report. The rule targets key directories such as C:\Windows\Temp, C:\Users\Public\Appfile, and C:\Perflogs, which are explicitly mentioned in the report as locations where malicious files and executables have been found. Additionally, the rule detects specific malicious file names like backup.bat, cl64.exe, and nc.exe, which are also listed in the report. Furthermore, the detection of randomly named executables (C:\Windows\[a-zA-Z]{8}.exe) matches the file-naming patterns used by PRC actors.
title: Suspicious File System Activity in Common Paths Used by PRC State-Sponsored Actors
id: eefd10b9-3c3e-4659-a410-357d60abf06d
status: experimental
description: Detects file system activity in paths commonly used by PRC state-sponsored actors for placing malicious files.
references:
  - https://media.defense.gov/2023/May/24/2003229517/-1/-1/0/CSA_Living_off_the_Land.PDF
author: System Two Security
date: 2024/10/11
tags:
  - attack.persistence
  - attack.t1036.005
logsource:
  product: windows
  category: file_event
detection:
  selection1:
    TargetFilename|startswith:
      - C:\Windows\Temp
      - C:\Users\Public\Appfile
      - C:\Perflogs
  selection2:
    TargetFilename|endswith:
      - \WmiPreSV.exe
      - \SMSvcService.exe
      - \billaudit.exe
      - \watchdogd.exe
      - \rar.exe
      - \cl64.exe
      - \Win.exe
      - \update.bat
      - \backup.bat
      - \cisco_up.exe
      - \WmiPrvSE.exe
      - \billagent.exe
      - \nc.exe
      - \vm3dservice.exe
      - \update.exe
  selection3:
    TargetFilename|re: C:\\Windows\\[a-zA-Z]{8}\\.exe
  condition: selection1 or selection2 or selection3
falsepositives:
  - Legitimate administrative activity that involves the specified file paths and names.
level: high
