# review_report_url: https://redcanary.com/threat-detection-report/trends/info-stealers
# review_date: 2024-12-03
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This rule monitors the creation or modification of DLL files in C:\ProgramData\, a behavior uncommon for legitimate applications but often associated with malware like Vidar stealer. Legitimate software typically stores DLLs in C:\Program Files\ or system directories, not shared data locations.
title: Detection of Vidar Stealer DLL File Modifications in ProgramData
id: 42aa3997-3bb8-4317-808c-ec4ba48a9f01
status: experimental
description: Detects the creation or modification of DLL files in the root of the ProgramData folder, which is a behavior associated with Vidar stealer malware and its derivatives.
references:
  - https://redcanary.com/threat-detection-report/trends/info-stealers
author: System Two Security
date: 2024/11/15
tags:
  - attack.persistence
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|startswith: C:\\ProgramData\\
    TargetFilename|endswith: .dll
  condition: selection
falsepositives:
  - Legitimate applications that store DLLs in the ProgramData folder by design
level: high
