# review_report_url: https://www.sentinelone.com/labs/bluenoroff-hidden-risk-threat-actor-targets-macs-with-fake-crypto-news-and-novel-persistence
# review_date: 2024-11-18
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This Sigma monitors for specific SHA1 hashes associated with malware deployed by the BlueNoroff Hidden Risk threat actor targeting Mac systems. The rule leverages MacOS file delete logs to identify file interactions linked to known indicators of compromise (IOCs). These SHA1 hashes represent malicious files associated with the actor's persistence and crypto-targeting campaigns.

title: Detection of BlueNoroff Hidden Risk Malware by SHA1 Hash
id: 9a309513-d73c-4597-8e42-84cc83f1bfb7
status: experimental
description: Detects the presence of files associated with the BlueNoroff Hidden Risk threat actor targeting Macs with fake crypto news and novel persistence mechanisms.
references:
  - https://www.sentinelone.com/labs/bluenoroff-hidden-risk-threat-actor-targets-macs-with-fake-crypto-news-and-novel-persistence
author: System Two Security
date: 2024/11/22
tags:
  - attack.persistence
logsource:
  category: file_delete
  product: macos
detection:
  sha1_hashes:
    sha1|contains:
      - 3f17c5a7d1e7fd138163d8039e614b8a967a56cb
      - baf4da6b89b7d7cbf24c9deef5984ef9dfd52e6a
      - 7e07765bf8ee2d0b2233039623016d6dfb610a6d
      - e5d97afa5f1501b3d5ec1a471dc8a3b8e2a84fdb
      - 05c178891ca1e65af53bbcfdbec573da3f74d176
  condition: sha1_hashes
falsepositives:
  - Legitimate software that coincidentally has a matching SHA1 hash
level: high
