# review_report_url: https://unit42.paloaltonetworks.com/kimsuky-new-keylogger-backdoor-variant/
# review_date: 2024-10-07
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This Sigma rule is designed to detect the creation of a file named sys.dll in the C:\Users\user\AppData\Local\Microsoft\WPSOffice\ directory, which is a known behavior associated with the FPSpy malware. The rule monitors file creation events for any new instances of sys.dll within this specific directory, as the presence of this file is indicative of malicious activity related to FPSpy. It uses both the startswith and endswith conditions to ensure that only files in the correct location with the exact name are detected. However, it is important to note that some legitimate applications may also create a sys.dll file in the same directory. This potential for false positives is acknowledged in the false positives section, highlighting the need for careful investigation of alerts to differentiate between malicious and benign behavior.
title: Detection of FPSpy Malware sys.dll File Creation
id: e3fe164a-85d1-4221-a758-1045b059bef0
status: experimental
description: Detects the creation of a sys.dll file in the C:\Users\user\AppData\Local\Microsoft\WPSOffice\ directory which is indicative of FPSpy malware activity.
references:
  - https://unit42.paloaltonetworks.com/kimsuky-new-keylogger-backdoor-variant
author: System Two Security
date: 2024/10/02
tags:
  - attack.persistence
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|startswith: C:\Users\user\AppData\Local\Microsoft\WPSOffice\
    TargetFilename|endswith: sys.dll
  condition: selection
falsepositives:
  - Legitimate software that uses a sys.dll file in the specified directory
level: high
