# review_report_url: https://www.mandiant.com/sites/default/files/2022-02/rt-apt41-dual-operation.pdf
# review_date: 2024-11-03
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This Sigma rule detects malicious 7z attachments used by APT41, specifically targeting files named Documents.7z and executed by 7z.exe. It helps identify potentially harmful file events related to APT41's exploitation tactics.

title: APT41 Document 7z Attachment Detection
id: 6baf95ca-d04a-4e58-82fc-ec1ba0b122e4
status: experimental
description: Detects the use of a specific MD5 hash related to APT41's malicious 7z attachment
references:
  - https://www.mandiant.com/sites/default/files/2022-02/rt-apt41-dual-operation.pdf
author: System Two Security
date: 2024/10/25
tags:
  - attack.execution
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|endswith: Documents.7z
    Image|endswith: \7z.exe
  condition: selection
falsepositives:
  - Legitimate software or files that happen to have the same file name
level: high
