# review_report_url: https://www.elastic.co/security-labs/beyond-the-wail
# review_date: 2024-10-07
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - The provided Sigma rule, designed to detect the creation of a file named /password-entered by the BANSHEE Infostealer malware, aligns perfectly with the behavior outlined in the associated CTI report. The report details how BANSHEE prompts users with a fake password request via Osascript on macOS systems, validates the password using the dscl command, and subsequently writes the stolen credentials to a file named /Users/<username>/password-entered. The Sigma rule specifically monitors for the creation of files with this exact naming convention, making it a highly effective detection mechanism for this malware's credential-stealing activities.

title: BANSHEE Infostealer Password File Creation
id: 515907de-0a2c-45b0-9320-fa36f3335d46
status: experimental
description: Detects the creation of a specific file used by BANSHEE malware to store stolen passwords
references:
  - https://www.elastic.co/security-labs/beyond-the-wail
author: System Two Security
date: 2024/10/02
tags:
  - attack.credential-access
logsource:
  product: macos
  category: file_event
detection:
  selection:
    TargetFilename|endswith: /password-entered
  condition: selection
falsepositives:
  - Legitimate applications that use a similar naming convention for their files
level: high
