# review_report_url: https://news.sophos.com/en-us/2021/03/05/hafnium-advice-about-the-new-nation-state-attack/
# review_date: 2024-10-26
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - The sigma rule is properly aligned with the CTI report, accurately reflecting the identified directories used in HAFNIUM attacks for web shell placement, with no discrepancies found between the paths or detection logic, making it ready for deployment with consideration for potential false positives from legitimate administrative activities.
title: HAFNIUM Group Web Shell File Creation
id: 604beef3-be03-417a-8933-24b40fbe1014
status: experimental
description: Detects the creation of web shells by HAFNIUM group in specific directories used in their attacks
references:
  - https://news.sophos.com/en-us/2021/03/05/hafnium-advice-about-the-new-nation-state-attack
author: System Two Security
date: 2024/10/25
tags:
  - attack.persistence
  - attack.t1505.003
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|startswith:
      - C:\Exchange\FrontEnd\HttpProxy\owa\auth\
      - C:\inetpub\wwwroot\aspnet_client\system_web\
      - '%PROGRAMFILES%\Microsoft\Exchange Server\V15\FrontEnd\HttpProxy\owa\auth\'
      - C:\inetpub\wwwroot\aspnet_client\
  condition: selection
falsepositives:
  - Legitimate administrative activity that involves creating files in the monitored directories.
level: high
