# review_report_url: https://www.cybereason.com/blog/research/back-to-the-future-inside-the-kimsuky-kgh-spyware-suitehttps://www.cybereason.com/blog/research/back-to-the-future-inside-the-kimsuky-kgh-spyware-suite
# review_date: 2024-10-16
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This Sigma rule identifies the creation of the msfltr32.dll file by the winword.exe process, indicating potential activity linked to the KGH spyware suite, which possesses capabilities such as persistence, keylogging, and command execution. By monitoring for this specific file creation, the rule aims to detect malicious behavior associated with the spyware. The rule also notes the risk of false positives from legitimate software that may use a similar filename during installation or updates.

title: Detection of KGH Spyware Payload msfltr32.dll Creation by winword.exe
id: b6312ba3-26ca-4308-8286-059d7952e8c4
status: experimental
description: Detects the creation of the file msfltr32.dll by winword.exe, which is associated with the KGH spyware suite and has backdoor capabilities such as persistence, keylogging, downloading additional payloads, and executing arbitrary commands.
references:
  - https://www.cybereason.com/blog/research/back-to-the-future-inside-the-kimsuky-kgh-spyware-suite
author: System Two Security
date: 2024/10/11
tags:
  - attack.persistence
logsource:
  product: windows
  category: file_event
detection:
  selection:
    Image: winword.exe
    TargetFilename|endswith: \msfltr32.dll
  condition: selection
falsepositives:
  - Legitimate software installation or update that uses a similarly named file.
level: high
