# review_report_url: https://blog.sekoia.io/stealc-a-copycat-of-vidar-and-raccoon-infostealers-gaining-in-popularity-part-1
# review_date: 2024-12-03
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This rule detects file system activity indicating potential data theft from the Torch web browser user data directory \Torch\User Data
title: Detection of Stealc Infostealer Targeting Torch Browser Data
id: e1edfa7b-7520-4be9-863e-1ecd0439a1b2
status: experimental
description: Detects file system activity indicating potential data theft from the Torch web browser user data directory.
references:
  - https://blog.sekoia.io/stealc-a-copycat-of-vidar-and-raccoon-infostealers-gaining-in-popularity-part-1
author: System Two Security
date: 2024/11/15
tags:
  - attack.exfiltration
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|endswith: \Torch\User Data
  condition: selection
falsepositives:
  - Legitimate software or administrative tools accessing the user data directory for maintenance or backup purposes.
level: high
