# review_report_url: https://www.microsoft.com/en-us/security/blog/2023/10/18/multiple-north-korean-threat-actors-exploiting-the-teamcity-cve-2023-42793-vulnerability/
# review_date: 2024-10-27
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This detection rule monitors for the creation or modification of clip.exe in the C:\ProgramData\ directory, which may indicate a potential DLL search-order hijacking attempt, as attackers can use this location to exploit legitimate binaries. This behavior is rare for legitimate software, making it a strong indicator of potential malicious activity. Careful validation is advised to rule out legitimate software installation or updates.
title: Suspicious File Creation Indicating Potential DLL Search-Order Hijacking
id: a67f7f87-40c2-44c6-8ff5-410a852b16c4
status: experimental
description: Detects the creation or modification of a file named clip.exe in the C:\ProgramData\ directory, which may indicate an attempt at DLL search-order hijacking.
references:
  - https://www.microsoft.com/en-us/security/blog/2023/10/18/multiple-north-korean-threat-actors-exploiting-the-teamcity-cve-2023-42793-vulnerability
author: System Two Security
date: 2024/10/25
tags:
  - attack.defense-evasion
  - attack.t1574.001
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|endswith: \clip.exe
    Image|startswith: C:\ProgramData\
  condition: selection
falsepositives:
  - Legitimate software that uses the same file name and path for legitimate purposes.
level: high
