# review_report_url: https://www.microsoft.com/en-us/security/blog/2023/10/18/multiple-north-korean-threat-actors-exploiting-the-teamcity-cve-2023-42793-vulnerability/
# review_date: 2024-10-27
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This rule monitors for the creation or modification of wsmprovhost.exe within the ProgramData directory, a tactic potentially used for DLL search-order hijacking in malicious campaigns. The file's unusual placement can indicate a high-risk scenario, as attackers may use it to elevate privileges or maintain persistence. Legitimate use is rare, so any detections warrant further investigation for possible malicious activity.
title: Suspicious File Creation Indicating Potential DLL Search-Order Hijacking
id: ea5308f6-69d8-4dd9-9977-1f09d306ae94
status: experimental
description: Detects the creation or modification of a file that could indicate DLL search-order hijacking, specifically the wsmprovhost.exe file in the ProgramData directory.
references:
  - https://www.microsoft.com/en-us/security/blog/2023/10/18/multiple-north-korean-threat-actors-exploiting-the-teamcity-cve-2023-42793-vulnerability
author: System Two Security
date: 2024/10/25
tags:
  - attack.execution
  - attack.t1574.001
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|endswith: \wsmprovhost.exe
  condition: selection
falsepositives:
  - Legitimate software installation or update that uses the same filename for legitimate purposes.
level: high
