# review_report_url: https://blog.sekoia.io/stealc-a-copycat-of-vidar-and-raccoon-infostealers-gaining-in-popularity-part-1
# review_date: 2024-12-03
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - The rule  detects file access events targeting Ethereum wallet keystore files, leveraging specific path and process indicators to align with known malicious behaviors targeting cryptocurrency wallets.
title: Detection of Ethereum Wallet Keystore File Access
id: c6c69daf-98c2-4682-91e6-e224f3220121
status: experimental
description: Detects file access or creation events targeting Ethereum wallet keystore files, which may indicate an information-stealing malware attack.
references:
  - https://blog.sekoia.io/stealc-a-copycat-of-vidar-and-raccoon-infostealers-gaining-in-popularity-part-1
author: System Two Security
date: 2024/11/15
tags:
  - attack.credential-access
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|endswith: \keystore
    Image|endswith: \Ethereum\
  condition: selection
falsepositives:
  - Legitimate Ethereum wallet software or backup operations
level: high
