# review_report_url:https://gurucul.com/blog/apt28s-oceanmap-backdoor/
# review_date: 2024-10-26
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - The Sigma rule directly matches the persistence technique described in the CTI report, as both indicate that the APT28 OCEANMAP backdoor uses a .url file in the Startup Folder for persistence.

title: APT28 OCEANMAP Backdoor Persistence via Startup Folder Shortcut
id: cec8d4ee-7fbd-470e-8328-ea7fc0bb8659
status: experimental
description: Detects the creation of an Internet Shortcut (.URL file) in the Windows Startup Folder, which may indicate persistence mechanism used by APT28 OCEANMAP backdoor.
references:
  - https://gurucul.com/blog/apt28s-oceanmap-backdoor
author: System Two Security
date: 2024/10/25
tags:
  - attack.persistence
  - attack.t1547.009
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|startswith: C:\Users\
    TargetFilename|contains|all:
      - \AppData\Roaming\Microsoft\Windows\Start Menu\Programs\Startup
      - .url
  condition: selection
falsepositives:
  - Legitimate applications that create shortcuts in the Startup folder for persistence.
level: high
