# review_report_url: https://unit42.paloaltonetworks.com/kimsuky-new-keylogger-backdoor-variant/
# review_date: 2024-10-07
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This rule is designed to detect files generated by the KLogExe malware, focusing specifically on the naming convention of keylogger output files. The regex pattern desktops\.ini_\d+_\d+_\d+_\d+ captures filenames that start with "desktops.ini_" followed by four numeric segments separated by underscores. This pattern aligns with the malware's behavior of appending a date and random boundary to the filename. The rule uses the TargetFilename field to flag any file matching this pattern as potentially malicious. However, it is important to note that legitimate applications may also create similar files, so false positives should be considered, and further investigation may be necessary.
title: Exfiltration of Keylogger Data via HTTP POST
id: 1229a00c-5856-419a-b0db-65ddd2fe3cef
status: experimental
description: Detects the exfiltration of keylogger data with a specific file naming pattern including a date and a random boundary, indicative of the Sparkling Pisces KLogExe malware.
references:
  - https://unit42.paloaltonetworks.com/kimsuky-new-keylogger-backdoor-variant
author: System Two Security
date: 2024/10/02
tags:
  - attack.exfiltration
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|re: desktops\.ini_\d+_\d+_\d+_\d+
  condition: selection
falsepositives:
  - Legitimate applications that use .ini files with similar naming patterns
level: high
