# review_report_url: https://blog.sekoia.io/stealc-a-copycat-of-vidar-and-raccoon-infostealers-gaining-in-popularity-part-1
# review_date: 2024-12-03
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This rule detects file system events involving access to the \Mozilla\Firefox\Profiles directory, indicating potential data theft attempts. It does not trigger based on the presence of Firefox but only when the profile data is actively accessed.
title: Detection of Mozilla Firefox Profile Access Indicative of Data Theft
id: 675a3389-f988-49c6-b1fa-21b01b896d82
status: experimental
description: Detects file system activity for access to paths containing "\Mozilla\Firefox\Profiles" which may indicate theft of Mozilla Firefox browser data.
references:
  - https://blog.sekoia.io/stealc-a-copycat-of-vidar-and-raccoon-infostealers-gaining-in-popularity-part-1
author: System Two Security
date: 2024/11/15
tags:
  - attack.credential-access
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|contains: \Mozilla\Firefox\Profiles
  condition: selection
falsepositives:
  - Legitimate software or administrative tools accessing Firefox profile data.
  - Legitimate backup operations.
level: high
