# review_report_url: https://www.ncsc.gov.uk/files/Advisory-APT29-targets-COVID-19-vaccine-development-V1-1.pdf
# review_date: 2024-10-27
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - The sigma rule is accurately aligned with the CTI report’s description of SoreFang’s key schedule algorithm.
title: Detection of SoreFang Malware Key Schedule Algorithm
id: 3dde2582-2519-4993-a0ac-221f5645dc25
status: experimental
description: Detects the presence of a specific key schedule algorithm used by SoreFang malware, which is a strong indicator of compromise (IoC).
references:
  - https://www.ncsc.gov.uk/files/Advisory-APT29-targets-COVID-19-vaccine-development-V1-1.pdf
author: System Two Security
date: 2024/10/25
tags:
  - attack.execution
logsource:
  product: windows
  category: file_event
detection:
  selection:
    MagicHeader|startswith: MZ
    Image|contains: '{C7 05 ?? ?? ?? ?? 63 51 E1 B7 B8 ?? ?? ?? ?? 8B 48 FC 81 E9 47 86 C8 61 89 08 83 C0 04 3D ?? ?? ?? ?? 7E EB 33 D2 33 C9 B8 2C 00 00 00 89 55 D4 33 F6 89 4D D8 33 DB 3B F8 0F 4F C7 8D 04 40 89 45 D0 83 F8 01 7C 4F 0F 1F 80 00 00 00 00}'
  condition: selection
falsepositives:
  - Legitimate applications using the same key schedule algorithm by coincidence
level: high
