# review_report_url: https://blog.sekoia.io/stealc-a-copycat-of-vidar-and-raccoon-infostealers-gaining-in-popularity-part-1
# review_date: 2024-12-03
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This rule detects file system activity targeting the \Amigo\User Data directory, which may indicate data theft by threats like the Stealc infostealer.
title: Stealc Infostealer - Amigo Browser Data Theft
id: b510e79a-2917-4c46-a65b-8abe0bdb1a74
status: experimental
description: Detects file system activity indicating potential data theft from Amigo browser user data directory
references:
  - https://blog.sekoia.io/stealc-a-copycat-of-vidar-and-raccoon-infostealers-gaining-in-popularity-part-1
author: System Two Security
date: 2024/11/15
tags:
  - attack.collection
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|contains: \Amigo\User Data
  condition: selection
falsepositives:
  - Legitimate software or administrative tools accessing the Amigo browser user data directory
level: high
