# review_report_url: URL
# review_date: 2024-09-12
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - The rule matches with CTI report perfectly by detecting the creation of Rclone via Sysmon Event ID 11. Also, it aligns with MITRE ATT&CK techniques
title: Rclone Dropped on File Server
id: e155cb1d-dd6f-4458-b98a-f5cbb24b7127
status: experimental
description: Detects the creation of Rclone executable on a file server which may indicate an exfiltration attempt
references:
  - https://thedfirreport.com/2024/06/10/icedid-brings-screenconnect-and-csharp-streamer-to-alphv-ransomware-deployment
author: System Two Security
date: 2024/09/10
tags:
  - attack.exfiltration
logsource:
  product: windows
  category: file_change
detection:
  selection:
    EventID: 11
    TargetFilename|contains|all:
      - rclone.exe
      - C:\\ProgramData\\
      - windows-amd64\\
      - rclone-v
  condition: selection
falsepositives:
  - Legitimate installation of Rclone by system administrators
level: high
