# review_report_url: https://www.ncsc.gov.uk/files/Advisory-APT29-targets-COVID-19-vaccine-development-V1-1.pdf
# review_date: 2024-10-27
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - The sigma rule is correctly aligned with the CTI report and ready for production deployment. It provides robust detection for WellMail malware based on unique binary strings.
title: Detection of WellMail Malicious Activity
id: 4827c52a-9c98-47a6-9e7c-0fc6be3ab32d
status: experimental
description: Detects WellMail based on unique strings contained in the binary as reported by NCSC.
references:
  - https://www.ncsc.gov.uk/files/Advisory-APT29-targets-COVID-19-vaccine-development-V1-1.pdf
author: System Two Security
date: 2024/10/25
tags:
  - attack.execution
logsource:
  product: linux
  category: file_event
detection:
  selection:
    TargetFilename|contains|all:
      - 042a51567eea19d5aca71050b4535d33d2ed43ba
      - '@[^\\s]+?\\s(?P<tar>.*?)\\s'
      - HgQdbx4qRNv
      - C:/Server/Mail/App_Data\\Temp\\agent.sh\\src/main.go
      - C:\\Server\\Mail\\App_Data\\Temp\\agent.sh\\src
      - main.zipit
  condition: selection
falsepositives:
  - Legitimate software that uses similar directory structures or file names
level: high
