# review_report_url: https:https://www.microsoft.com/en-us/security/blog/2021/03/02/hafnium-targeting-exchange-servers/
# review_date: 2024-10-27
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - The sigma rule is well-aligned with the CTI report by focusing on UMWorkerProcess.exe generating abnormal content and excluding legitimate files. To enhance detection capabilities, it is recommended to create a complementary Sigma rule to monitor for abnormal child processes spawned by UMWorkerProcess.exe. This will ensure comprehensive detection of both content-based and process-based indicators of exploitation related to CVE-2021-26858. The current rule is ready for deployment with these minor adjustments.
title: Detection of UMWorkerProcess.exe Creating Abnormal Content
id: 05559613-e8b4-4110-af1d-fb80ff4d7a30
status: experimental
description: Detects the creation of non-standard content by UMWorkerProcess.exe, which could indicate web shells or other malicious content, suggesting exploitation of CVE-2021-26858.
references:
  - https://www.microsoft.com/en-us/security/blog/2021/03/02/hafnium-targeting-exchange-servers
author: System Two Security
date: 2024/10/25
tags:
  - attack.persistence
logsource:
  product: windows
  category: file_event
detection:
  selection:
    Image|endswith: \UMWorkerProcess.exe
    TargetFilename|endswith:
      - .LOG
      - .txt
      - .bin
      - .cfg
  exclusion:
    TargetFilename:
      - CacheCleanup.bin
      - cleanup.bin
  condition: selection and not exclusion
falsepositives:
  - Legitimate administrative activity that involves running scripts or tasks using UMWorkerProcess.exe which may generate non-standard content.
level: high
