# review_author: Blackperl
# review_date: 2024-12-11
# review_report_url: https://cloud.google.com/blog/topics/threat-intelligence/apt41-arisen-from-dust
# review_rule_useful: Yes
# review_rule_classification: Proceed to testing
# review_rule_ttp_match: Yes
# review_notes: This rule detects the presence of `C:\ProgramData\auth.json`, an authentication file associated with APT41's PINEGROVE tool used for data exfiltration to OneDrive. It monitors file creation or presence events and highlights potential misuse, though legitimate usage of such a file in this path is possible but rare.

title: Detection of PINEGROVE Data Exfiltration via OneDrive
id: b2aaa500-0dc1-4625-8978-60cd1b430c11
status: experimental
description: Detects the access of the authentication file used by the PINEGROVE data exfiltration tool.
references:
  - https://cloud.google.com/blog/topics/threat-intelligence/apt41-arisen-from-dust
author: System Two Security
date: 2024/11/28
tags:
  - attack.exfiltration
logsource:
  product: windows
  category: file_access
detection:
  selection:
    FileName: C:\ProgramData\auth.json
  condition: selection
falsepositives:
  - Legitimate access to the file by authorized personnel.
level: high
