# review_report_url: https://www.cisa.gov/news-events/cybersecurity-advisories/aa24-038a
# review_date: 2024-10-17
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - The Sigma rule perfectly aligns with the threat detailed in the CTI report, as both sources highlight the same tactic used by PRC state-sponsored actors. Aditionaly both the Sigma rule and the CTI report focus on detecting the suspicious use of comsvcs.dll in non-standard directories, particularly C:\windows\temp\ and C:\users\public\.

title: Detection of comsvcs.dll in Non-Standard Folders
id: a7f66fab-1f36-426a-8420-7d2776c1ea9a
status: experimental
description: Detects the presence of comsvcs.dll in non-standard folders, which could indicate that PRC state-sponsored actors have compromised the system.
references:
  - https://www.cisa.gov/news-events/cybersecurity-advisories/aa24-038a
author: System Two Security
date: 2024/09/18
tags:
  - attack.persistence
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|contains|all:
      - \users\public\\
      - \windows\temp\\
    TargetFilename|endswith: \comsvcs.dll
  condition: selection
falsepositives:
  - Legitimate software that uses the same filename in non-standard directories
level: high
