# review_report_url: https://news.sophos.com/en-us/2021/07/04/independence-day-revil-uses-supply-chain-exploit-to-attack-hundreds-of-businesses/amp/
# review_date: 2024-11-05
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This Sigma rule detects REvil ransomware behavior by identifying instances where agent.exe drops files named msmpeng.exe and mpsvc.dll into the C:\Windows directory. This technique is associated with side-loading attacks used by REvil to exploit legitimate Windows Defender components. Given the specificity of the file paths and filenames, any alerts generated by this rule should be treated with high priority, though legitimate installations should be verified to avoid false positives.
title: REvil Ransomware Dropping MSMPENG.EXE and MPSVC.DLL
id: 733c3bfb-1061-4d8b-b486-cb7fd4b5f7d7
status: experimental
description: Detects the dropping of MSMPENG.EXE and MPSVC.DLL into the C:\Windows directory by AGENT.EXE, which is indicative of the REvil ransomware side-loading attack.
references:
  - https://news.sophos.com/en-us/2021/07/04/independence-day-revil-uses-supply-chain-exploit-to-attack-hundreds-of-businesses/amp
author: System Two Security
date: 2024/10/25
tags:
  - attack.impact
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|endswith:
      - \\mpsvc.dll
      - \\msmpeng.exe
    Image|endswith: \\agent.exe
  condition: selection
falsepositives:
  - Legitimate software installation or update processes that use similar filenames or paths.
level: critical
