# review_report_url: https://blog.sekoia.io/stealc-a-copycat-of-vidar-and-raccoon-infostealers-gaining-in-popularity-part-1
# review_date: 2024-12-03
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This Sigma rule identifies suspicious activity to Chedot Browser's user data directory-a potential sign of data theft. This rule targets file activity under the "User Data" directory. It may pick up false positives from an actual browser update, legitimate system processes, or system backup software.
title: Detection of Chedot Browser Data Theft
id: a5bee8cc-1a2a-4832-b5c5-b958429ee5ba
status: experimental
description: Detects file system activity indicating potential data theft from Chedot Browser user data directory.
references:
  - https://blog.sekoia.io/stealc-a-copycat-of-vidar-and-raccoon-infostealers-gaining-in-popularity-part-1
author: System Two Security
date: 2024/11/15
tags:
  - attack.collection
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|contains: \Chedot\User Data
  condition: selection
falsepositives:
  - Legitimate browser or system update process accessing the user data directory
  - Backup software accessing the user data directory
level: high
