# review_report_url: https://www.cisa.gov/news-events/cybersecurity-advisories/aa24-207a
# review_date: 2024-10-27
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This Sigma rule detects files with .dll or .exe extensions containing the MZ header, indicative of executable files, which have unusual section names (vmp0 and vmp1) commonly associated with VMProtect and Themida packing. These packers are frequently used to evade debugging and detection mechanisms. False positives may include legitimate applications that use VMProtect or Themida for protection.
title: Detection of VMProtect and Themida Packed Executables
id: 044efe31-dd90-456f-8334-900ecebfd8e7
status: experimental
description: Detects files with unusual section names indicative of VMProtect and Themida packing, which are commonly used by adversaries to evade defenses.
references:
  - https://www.cisa.gov/news-events/cybersecurity-advisories/aa24-207a
author: System Two Security
date: 2024/10/25
tags:
  - attack.defense-evasion
  - attack.t1027.002
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|endswith:
      - .dll
      - .exe
    MagicHeader: MZ
  keyword_section_names:
    Image|contains|all:
      - vmp0
      - vmp1
  condition: selection and keyword_section_names
falsepositives:
  - Legitimate applications that use VMProtect or Themida for software protection
level: high
