# review_report_url: https://blog.sekoia.io/stealc-a-copycat-of-vidar-and-raccoon-infostealers-gaining-in-popularity-part-1
# review_date: 2024-12-03
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This rule is designed to detect file system activity specifically targeting the \Google\Chrome\User Data directory, which may indicate an attempt to steal browser data using the Stealc infostealer. Since this directory is often accessed by legitimate tools like browser sync services or backup software, careful tuning is necessary to avoid excessive false positives
title: Stealc Infostealer - Browser Data Theft Detection
id: f0653806-a5f3-4ea5-9ae0-5f1a92155e25
status: experimental
description: Detects file system activity indicating potential theft of browser data by Stealc infostealer.
references:
  - https://blog.sekoia.io/stealc-a-copycat-of-vidar-and-raccoon-infostealers-gaining-in-popularity-part-1
author: System Two Security
date: 2024/11/15
tags:
  - attack.collection
  - attack.t1217
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|contains: \Google\Chrome\User Data
  condition: selection
falsepositives:
  - Legitimate browser profile synchronization tools or backup software accessing the browser user data path.
level: high
