# review_report_url: https://blog.sekoia.io/stealc-a-copycat-of-vidar-and-raccoon-infostealers-gaining-in-popularity-part-1
# review_date: 2024-12-03
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This Sigma rule detects file access or creation events related to the Binance wallet, possibly indicating malware targeting sensitive wallet data. Access to files such as "simple-storage.json" or ".finger-print.fp" by unauthorized users should be looked into. False positives may occur because legitimate administrative actions can trigger them.
title: Detection of Binance Wallet File Access
id: 6b258e05-5329-49f2-9c8a-2738819424d5
status: experimental
description: Detects file access or creation events targeting specific paths and file names for the Binance wallet, which may indicate an information-stealing malware attack.
references:
  - https://blog.sekoia.io/stealc-a-copycat-of-vidar-and-raccoon-infostealers-gaining-in-popularity-part-1
author: System Two Security
date: 2024/11/15
tags:
  - attack.credential-access
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|contains|all:
      - \Binance\simple-storage.json
      - \Binance\app-store.json
      - \Binance\\.finger-print.fp
  condition: selection
falsepositives:
  - Legitimate software or administrative tools accessing these files.
level: high
