# review_report_url: https://www.microsoft.com/en-us/security/blog/2023/10/18/multiple-north-korean-threat-actors-exploiting-the-teamcity-cve-2023-42793-vulnerability/
# review_date: 2024-10-27
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This detection rule monitors for file creation events specifically targeting the inetmgr.exe file within the C:\Windows\ADFS\bg\ directory, which is associated with Onyx Sleet APT activity. An alert is generated if this file is created, indicating a potential compromise or malicious action. False positives are considered unlikely, as this file path is not typically used for legitimate purposes.
title: Onyx Sleet APT File Creation Indicators
id: 2fef4fd9-7206-40d1-b4f5-ad6441d0cd9b
status: experimental
description: Detects file creation activity that is related to Onyx Sleet APT activity
references:
    - https://www.microsoft.com/en-us/security/blog/2023/10/18/multiple-north-korean-threat-actors-exploiting-the-teamcity-cve-2023-42793-vulnerability/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/10/24
tags:
    - attack.execution
    - detection.emerging_threats
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|endswith: ':\Windows\ADFS\bg\inetmgr.exe'
    condition: selection
falsepositives:
    - Unlikely
level: high
