# review_report_url: https:https://www.microsoft.com/en-us/security/blog/2021/03/02/hafnium-targeting-exchange-servers/
# review_date: 2024-10-27
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - The sigma rule is fully aligned with the CTI report by detecting the creation of suspicious archive files in C:\ProgramData\, a known path used for data exfiltration. The file types and directory path monitored in the rule match the CTI report exactly. For comprehensive coverage, it is recommended to create complementary rules for monitoring other suspicious activities (e.g., LSASS dumps in C:\windows\temp\) as mentioned in the CTI report. This rule is ready for deployment with the current configuration.
title: Detection of Suspicious Archive Files in C:\ProgramData\
id: b9a49145-5626-4688-b359-33d1d39a0385
status: experimental
description: Detects the creation or modification of suspicious .zip, .rar, and .7z files in C:\ProgramData\ which may indicate possible data exfiltration.
references:
  - https://www.microsoft.com/en-us/security/blog/2021/03/02/hafnium-targeting-exchange-servers
author: System Two Security
date: 2024/10/25
tags:
  - attack.exfiltration
  - attack.t1560.001
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|startswith: C:\ProgramData\
    TargetFilename|endswith:
      - .zip
      - .rar
      - .7z
  condition: selection
falsepositives:
  - Legitimate archive operations by system or application updates
  - Legitimate use of archiving tools by users
level: medium
