# review_report_url: https://news.sophos.com/en-us/2024/10/31/pacific-rim-timeline
# review_date: 2024-12-04
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This Sigma rule identifies the creation or modification of a file with a specific SHA-256 hash value linked to the `libsophos.so` rootkit, a tool reportedly used by the TStark threat actor. Due to the uniqueness of hash values, false positives are rare but may include benign software or processes coincidentally matching the hash.
title: Detection of libsophos.so with Specific Hash Value
id: 2e5503d2-a41b-45b9-8113-a8f41eb61eae
status: experimental
description: Detects the creation or modification of a file with the hash value c71cd27efcdb8c44ab8c29d51f033a22, which is associated with the libsophos.so rootkit used by the TStark actor.
references:
  - https://news.sophos.com/en-us/2024/10/31/pacific-rim-timeline
author: System Two Security
date: 2024/11/01
tags:
  - attack.persistence
logsource:
  product: linux
  category: file_delete
detection:
  selection:
    sha256|contains: c71cd27efcdb8c44ab8c29d51f033a22
  condition: selection
falsepositives:
  - Benign software or processes that coincidentally have the same hash value, although this is highly unlikely due to the specificity of the hash.
level: critical
