# review_author: Blackperl
# review_date: 2024-12-11
# review_report_url: https://www.picussecurity.com/resource/blog/ttps-hafnium-microsoft-exchange-servers
# review_rule_useful: Yes
# review_rule_classification: Proceed to testing
# review_rule_ttp_match: Yes
# review_notes: This Sigma rule detects known HAFNIUM web shell hashes linked to Exchange vulnerabilities using precise hash matching. It aligns with CTI for accurate detection and minimal false positives, ensuring effective identification of malicious activity.

title: HAFNIUM Exchange Webshell Hashes
id: 55d470c3-6225-4bed-aa6a-2cfc6826baa8
status: experimental
description: Detects the presence of known HAFNIUM webshell hashes related to the Microsoft Exchange Server vulnerabilities.
references:
  - https://www.picussecurity.com/resource/blog/ttps-hafnium-microsoft-exchange-servers
author: System Two Security
date: 2024/11/28
tags:
  - attack.persistence
logsource:
  product: windows
  category: file_executable_detected
detection:
  selection:
    Hashes|contains:
      - 1631a90eb5395c4e19c7dbcbf611bbe6444ff312eb7937e286e4637cb9e72944
      - 097549cf7d0f76f0d99edf8b2d91c60977fd6a96e4b8c3c94b0b1733dc026d3e
      - 811157f9c7003ba8d17b45eb3cf09bef2cecd2701cedb675274949296a6a183d
      - 2b6f1ebb2208e93ade4a6424555d6a8341fd6d9f60c25e44afe11008f5c1aad1
      - 4edc7770464a14f54d17f36dc9d0fe854f68b346b27b35a6f5839adf1f13f8ea
      - b75f163ca9b9240bf4b37ad92bc7556b40a17e27c2b8ed5c8991385fe07d17d0
      - 65149e036fff06026d80ac9ad4d156332822dc93142cf1a122b1841ec8de34b5
      - 511df0e2df9bfa5521b588cc4bb5f8c5a321801b803394ebc493db1ef3c78fa1
  condition: selection
falsepositives:
  - Legitimate use of these files (unlikely)
level: critical
