# review_report_url: https://www.microsoft.com/en-us/security/blog/2024/07/25/onyx-sleet-uses-array-of-malware-to-gather-intelligence-for-north-korea/
# review_date: 2024-09-22
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This Sigma rule is designed to detect file-related indicators of compromise (IOCs) associated with the Onyx Sleet campaign. It focuses on identifying specific file names (SmallTiger.dll) and SHA256 hashes of known malicious files. The rule utilizes Windows image load events as its data source, which aligns with the file-based detection approach mentioned in the CTI report.
title: Detection of File IOCs Related to Onyx Sleet Campaign
id: dd07f0f4-a104-4977-b3db-5028824e2811
status: experimental
description: Detects file-related indicators of compromise associated with the Onyx Sleet campaign, including specific file names, SHA256 hashes, signer names, signer hashes, and certificate serial numbers.
references:
  - https://www.microsoft.com/en-us/security/blog/2024/07/25/onyx-sleet-uses-array-of-malware-to-gather-intelligence-for-north-korea
author: System Two Security
date: 2024/09/09
tags:
  - attack.execution
logsource:
  product: windows
  category: image_load
detection:
  file_name:
    ImageLoaded|contains: SmallTiger.dll
  hashes_sha256:
    sha256|contains|all:
      - 8daa6b20caf4bf384cc7912a73f243ce6e2f07a5cb3b3e95303db931c3fe339f
      - 868a62feff8b46466e9d63b83135a7987bf6d332c13739aa11b747b3e2ad4bbf
      - f1662bee722a4e25614ed30933b0ced17b752d99fae868fbb326a46afa2282d5
      - f32f6b229913d68daad937cc72a57aa45291a9d623109ed48938815aa7b6005c
      - 1b88b939e5ec186b2d19aec8f17792d493d74dd6ab3d5a6ddc42bfe78b01aff1
      - 0837dd54268c373069fc5c1628c6e3d75eb99c3b3efc94c45b73e2cf9a6f3207
      - 3098e6e7ae23b3b8637677da7bfc0ba720e557e6df71fa54a8ef1579b6746061
      - 29c6044d65af0073424ccc01abcb8411cbdc52720cac957a3012773c4380bab3
      - 7339cfa5a67f5a4261c18839ef971d7f96eaf60a46190cab590b439c71c4742b
      - fed94f461145681dc9347b382497a72542424c64b6ae6fcf945f4becd2d46c32
  condition: file_name or hashes_sha256
falsepositives:
  - Legitimate software with a file name collision
  - Benign files that happen to have a hash collision with the IOCs
level: high
