# review_report_url: https://blog.talosintelligence.com/chinese-hacking-group-apt41-compromised-taiwanese-government-affiliated-research-institute-with-shadowpad-and-cobaltstrike-2
# review_date: 2024-11-03
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This detection flag identifies binaries with a certain RICH PE header hash correlated to the malware loader of ShadowPad. It is of a high alert level because it is improbable, yet possible, that legitimate applications will be having this hash.


title: Detection of ShadowPad Loader via RICH PE Header
id: aa791921-8ca9-42ff-aeb8-31d452a52711
status: experimental
description: Detects binaries with a specific RICH PE header value that is associated with ShadowPad loader malware.
references:
  - https://blog.talosintelligence.com/chinese-hacking-group-apt41-compromised-taiwanese-government-affiliated-research-institute-with-shadowpad-and-cobaltstrike-2
author: System Two Security
date: 2024/08/04
tags:
  - attack.command_and_control
logsource:
  product: windows
  category: image_load
detection:
  selection:
    ImageLoaded|endswith: .exe
    Hashes|contains: 978ece20137baea2bcb364b160eb9678
  condition: selection
falsepositives:
  - Legitimate software that coincidentally has the same RICH PE header hash (unlikely but theoretically possible)
level: high
