# review_report_url: https://www.elastic.co/security-labs/dipping-into-danger
# review_date: 2024-10-07
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - The sigma rule and CTI report are properly aligned, identifying the loading of release.dll as part of the WARMCOOKIE backdoor’s persistence mechanisms. The CTI report confirms that release.dll is referenced in WARMCOOKIE's activity, with additional detection supported by YARA rules targeting related behaviors.
title: Detection of WARMCOOKIE Backdoor DLL Load
id: a2cd3aaf-6be8-403b-865b-38f79b7c8d9e
status: experimental
description: Detects the loading or referencing of the "release.dll" file which is associated with the WARMCOOKIE backdoor.
references:
  - https://www.elastic.co/security-labs/dipping-into-danger
author: System Two Security
date: 2024/10/02
tags:
  - attack.persistence
logsource:
  product: windows
  category: image_load
detection:
  selection:
    ImageLoaded|endswith: release.dll
  condition: selection
falsepositives:
  - Legitimate software that uses a DLL named "release.dll"
level: high
