# review_report_url: https://bi-zone.medium.com/from-pentest-to-apt-attack-cybercriminal-group-fin7-disguises-its-malware-as-an-ethical-hackers-c23c9a75e321
# review_date: 2024-10-18
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This Sigma rule detects the loading of DLLs associated with Mimikatz, including both mimikatz32.dll and various powerkatz DLLs, which are indicative of credential theft activity. It triggers when these files are loaded into memory, potentially signaling credential dumping attempts by attackers. False positives may occur if legitimate system administrators or security researchers are using Mimikatz for authorized troubleshooting or analysis purposes.
title: Detection of Mimikatz DLL Activity
id: dea07b67-290e-4eab-9d4d-a67cbdd7f746
status: experimental
description: Detects the presence of Mimikatz DLLs which are indicative of credential theft activity.
references:
  - https://bi-zone.medium.com/from-pentest-to-apt-attack-cybercriminal-group-fin7-disguises-its-malware-as-an-ethical-hackers-c23c9a75e319
author: System Two Security
date: 2024/10/11
tags:
  - attack.credential-access
logsource:
  product: windows
  category: image_load
detection:
  selection:
    ImageLoaded|endswith:
      - \mimikatz32.dll
      - \mimikatz64.dll
    ImageLoaded|contains:
      - powerkatz_full64.dll
      - powerkatz_short64.dll
      - powerkatz_full32.dll
      - powerkatz_short32.dll
  condition: selection
falsepositives:
  - Legitimate use of Mimikatz by system administrators for troubleshooting.
level: high
