# review_report_url:https:https://www.splunk.com/en_us/blog/security/kaseya-sera-what-revil-shall-encrypt-shall-encrypt.html
# review_date: 2024-11-06
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This Sigma rule detects the loading of a malicious DLL called mpsvc.dll by an older version of MsMpEng.exe associated with ransomware activity of REvil. The detection depends on searches for specific hash values related to the malicious DLL. False positives are unlikely but theoretically possible due to the correct, legitimate usage of an older version of MsMpEng.exe. The rule has been rated with a critical severity level.
title: Detection of REvil Ransomware via MsMpEng.exe Sideloading
id: 6e48098a-7708-439c-9fdd-73df3fa330b6
status: experimental
description: Detects the loading of a specific malicious DLL by an older version of msmpeng.exe, which is indicative of REvil ransomware activity.
references:
  - https://www.splunk.com/en_us/blog/security/kaseya-sera-what-revil-shall-encrypt-shall-encrypt.html
author: System Two Security
date: 2024/10/25
tags:
  - attack.execution
logsource:
  product: windows
  category: image_load
detection:
  selection:
    Image: MsMpEng.exe
    ImageLoaded: mpsvc.dll
    Hashes|contains:
      - e2a24ab94f865caeacdf2c3ad015f31f23008ac6db8312c2cbfb32e4a5466ea2
      - 8dd620d9aeb35960bb766458c8890ede987c33d239cf730f93fe49d90ae759dd
  condition: selection
falsepositives:
  - Legitimate use of an older msmpeng.exe version with a legitimate mpsvc.dll, although this is highly unlikely and should be investigated.
level: critical
