# review_report_url: https://www.microsoft.com/en-us/security/blog/2024/08/28/peach-sandstorm-deploys-new-custom-tickler-malware-in-long-running-intelligence-gathering-operations/
# review_date: 2024-09-22
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This rule targets one of the malicious DLLs associated with the "Tickler" malware used by the "Peach Sandstorm" threat actor. The specific hash (fb70ff49411ce04951895977acfc06fa468e4aa504676dedeb40ba5cea76f37f) matches one of the IOCs listed in the CTI report. This DLL is likely a crucial component of the Tickler malware's functionality or persistence mechanism. This rule does not rely on filenames at all for detection, which is a strength. It uses only the SHA-256 hash, avoiding any potential issues related to filename-based detection. This approach prevents false positives that could occur if legitimate files had similar names, and it also catches the malicious DLL even if it's renamed.
title: Detection of Malicious DLL with Specific SHA-256 Hash
id: de0989cf-ec2a-45f1-9387-ee7080e061c2
status: experimental
description: Detects the execution or presence of a malicious DLL file with a known SHA-256 hash value.
references:
  - https://www.microsoft.com/en-us/security/blog/2024/08/28/peach-sandstorm-deploys-new-custom-tickler-malware-in-long-running-intelligence-gathering-operations
author: System Two Security
date: 2024/09/27
tags:
  - attack.execution
logsource:
  product: windows
  category: image_load
detection:
  sha256: 711d3deccc22f5acfd3a41b8c8defb111db0f2b474febdc7f20a468f67db0350
  condition: sha256
falsepositives:
  - Unknown. Hashes are unique to files, and this hash is associated with a known malicious file. Any detection should be investigated.
level: high
