# review_report_url: https://blog.talosintelligence.com/threat-actors-using-macropack/
# review_date: 2024-10-07
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This Sigma rule targets the detection of a 32-bit Havoc demon through a specific SHA256 hash in Windows image load events. The rule's detection logic directly correlates with the CTI report, accurately identifying the malicious file mentioned. The simple hash-based detection ensures high specificity and minimal false positives
title: Detection of 32-bit Havoc Demon Hash
id: 569d67b1-c5ae-47af-a00c-56ba0052e0d3
status: experimental
description: Detects the creation, modification, or execution of a file with a hash indicative of the 32-bit Havoc demon.
references:
  - https://blog.talosintelligence.com/threat-actors-using-macropack
author: System Two Security
date: 2024/10/03
tags:
  - attack.execution
logsource:
  product: windows
  category: image_load
detection:
  sha256: 2131de0cb705afa52f88ef70a87ee6c8662d38db0138efc4940218ee62d8a296
  condition: sha256
falsepositives:
  - Unknown. Hashes are unique to files, and this hash is associated with a known malicious file. Any detection should be investigated.
level: high
