# review_author: Blackperl
# review_date: 2024-12-11
# review_report_url: https://unit42.paloaltonetworks.com/edr-bypass-extortion-attempt-thwarted
# review_rule_useful: Yes
# review_rule_classification: Proceed to testing
# review_rule_ttp_match: Yes
# review_notes: This detection rule identifies the loading of vulnerable drivers (WNBIOS.sys, WN_64.sys) by disabler.exe, which is indicative of potential EDR evasion or other malicious activity. While legitimate use of these drivers is highly unlikely, such activity should be treated as critical and immediately investigated. This behavior is commonly associated with advanced threat actors attempting to disable security defenses. Regular monitoring and analysis of driver loads can help mitigate risks.

title: Vulnerable Driver Loading by Disabler.exe
id: f5eb27f1-9ad6-44e9-b5fd-3e9e36101cda
status: experimental
description: Detects the loading of vulnerable drivers (WNBIOS.sys, WN_64.sys) by disabler.exe, indicating potential EDR evasion and malicious activity.
references:
  - https://unit42.paloaltonetworks.com/edr-bypass-extortion-attempt-thwarted
author: System Two Security
date: 2024/11/28
tags:
  - attack.defense-evasion
logsource:
  product: windows
  category: image_load
detection:
  selection:
    ImageLoaded:
      - WNBIOS.sys
      - WN_64.sys
    OriginalFileName: disabler.exe
  condition: selection
falsepositives:
  - Legitimate use of the drivers.  This is unlikely but possible.  Further investigation is required.
level: high
