# review_report_url: https://www.microsoft.com/en-us/security/blog/2023/10/18/multiple-north-korean-threat-actors-exploiting-the-teamcity-cve-2023-42793-vulnerability/
# review_date: 2024-10-27
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This rule is designed to detect the presence of a known malicious HazyLoad binary by monitoring for a specific SHA-256 hash value associated with the file. The use of a unique hash minimizes the likelihood of false positives, as benign files are unlikely to match the specified hash. Any detection should be thoroughly investigated, given that it indicates the presence of a known threat.
title: Detection of HazyLoad Binary via SHA-256 Hash
id: 993cb144-12e6-4e1e-b089-359f15a2df2a
status: experimental
description: Detects the presence of a known malicious HazyLoad binary based on its SHA-256 hash value.
references:
  - https://www.microsoft.com/en-us/security/blog/2023/10/18/multiple-north-korean-threat-actors-exploiting-the-teamcity-cve-2023-42793-vulnerability
author: System Two Security
date: 2024/10/25
tags:
  - attack.execution
logsource:
  product: windows
  category: image_load
detection:
  selection:
    sha256|contains: 000752074544950ae9020a35ccd77de277f1cd5026b4b9559279dc3b86965eee
  condition: selection
falsepositives:
  - Unknown. The hash is specific to the malicious file and is unlikely to collide with benign files.
level: high
