# review_report_url: https://www.microsoft.com/en-us/security/blog/2024/08/28/peach-sandstorm-deploys-new-custom-tickler-malware-in-long-running-intelligence-gathering-operations/
# review_date: 2024-09-22
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - The Sigma rule is designed to detect file activity involving specific malicious file hashes. It targets Windows systems, focusing on image load events. The rule uses a list of SHA256 hashes to identify potentially malicious files, aligning closely with the threat intelligence provided in the CTI report. The rule's approach is highly effective in detecting the specific threat described in the CTI report. By focusing on SHA256 hashes, it provides a precise method for identifying known malicious files. This approach minimizes false positives while maintaining high fidelity in detecting the exact files of interest.
title: Detection of Malicious File Activity Based on File Hashes
id: 5cc9b011-b232-4307-ab37-1f8fd989dc6c
status: experimental
description: Detects file activity involving specific malicious file hashes that may indicate the presence of malware or unauthorized actions in the environment.
references:
  - https://www.microsoft.com/en-us/security/blog/2024/08/28/peach-sandstorm-deploys-new-custom-tickler-malware-in-long-running-intelligence-gathering-operations
author: System Two Security
date: 2024/09/27
tags:
  - attack.execution
logsource:
  product: windows
  category: image_load
detection:
  sha256:
    - ccb617cc7418a3b22179e00d21db26754666979b4c4f34c7fda8c0082d08cec4
    - 711d3deccc22f5acfd3a41b8c8defb111db0f2b474febdc7f20a468f67db0350
    - 5df4269998ed79fbc997766303759768ce89ff1412550b35ff32e85db3c1f57b
    - fb70ff49411ce04951895977acfc06fa468e4aa504676dedeb40ba5cea76f37f
    - 7eb2e9e8cd450fc353323fd2e8b84fbbdfe061a8441fd71750250752c577d198
  condition: sha256
falsepositives:
  - Benign files sharing the same hash due to hash collision (extremely rare)
  - Legitimate software that has been falsely reported as malicious
level: high
