# review_author: Blackperl
# review_date: 2024-12-11
# review_report_url: https://cloud.google.com/blog/topics/threat-intelligence/apt41-arisen-from-dust
# review_rule_useful: Yes
# review_rule_classification: Proceed to testing
# review_rule_ttp_match: Yes
# review_notes: This rule detects processes signed with code-signing certificates linked to APT41 and used in DUSTTRAP malware, based on specific certificate serial numbers. It monitors image load events on Windows systems to identify potential abuse of compromised or stolen certificates. False positives are unlikely, especially if the certificates are revoked.

title: APT41 DUSTTRAP Malware - Code Signing Certificate Abuse
id: 3f4148cd-ecd4-4396-afac-5ec63479e55d
status: experimental
description: Detects processes signed with code signing certificates abused by APT41, as observed in DUSTTRAP malware samples.  This rule leverages specific serial numbers from the certificates.
references:
  - https://cloud.google.com/blog/topics/threat-intelligence/apt41-arisen-from-dust
author: System Two Security
date: 2024/11/28
tags:
  - attack.defense-evasion
  - attack.t1553.002
logsource:
  product: windows
  category: image_load
detection:
  selection:
    Signature:
      contains:
        - 0a:2c:bf:9b:18:fe:1b:20:b9:4e:ca:c4:b0:78:b8:c1
        - 05:fa:8a:72:da:46:07:4f:de:1e:34:c7:46:61:ee:00
        - 6f:97:f1:3d:a5:5e:9f:70:a6:92:7e:d1:b3:3e:ee:ee
  condition: selection
falsepositives:
  - Legitimate software signed with the specified certificates (unlikely after certificate revocation).
level: high
