# review_report_url: https://www.cybereason.com/blog/research/back-to-the-future-inside-the-kimsuky-kgh-spyware-suite
# review_date: 2024-10-16
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This Sigma rule detects the presence of the KGH Spyware Suite by monitoring for specific SHA-256 hashes associated with the malware, indicating potential malicious activity. It focuses on file loading events in Windows to identify the execution of known KGH malware components. False positives are acknowledged for legitimate files that may inadvertently match the hashes, but such occurrences are considered unlikely.

title: Detection of KGH Spyware Suite
id: 8533d331-651f-43d8-82d1-b400b1c09afd
status: experimental
description: Detects the presence of the KGH Spyware Suite by monitoring for specific file hashes associated with the malware.
references:
  - https://www.cybereason.com/blog/research/back-to-the-future-inside-the-kimsuky-kgh-spyware-suite
author: System Two Security
date: 2024/10/11
tags:
  - attack.command-and-control
logsource:
  product: windows
  category: image_load
detection:
  sha256:
    - f989d13f7d0801b32735fee018e816f3a2783a47cff0b13d70ce2f1cbc754fb9
    - Bcf4113ec8e888163f1197a1dd9430a0df46b07bc21aba9c9a1494d2d07a2ba9
    - e9ea5d4e96211a28fe97ecb21b7372311a6fa87ce23db4dd118dc204820e011c
    - E4d28fd7e0fc63429fc199c1b683340f725f0bf9834345174ff0b6a3c0b1f60e
    - Fa282932f1e65235dc6b7dba2b397a155a6abed9f7bd54afbc9b636d2f698b4b
    - 65fe4cd6deed85c3e39b9c1bb7c403d0e69565c85f7cd2b612ade6968db3a85c
    - 252d1b7a379f97fddd691880c1cf93eaeb2a5e5572e92a25240b75953c88736c
    - 7af3930958f84e0b64f8297d1a556aab359bb65691208dc88ea4fc9698250c43
    - 97d4898c4e70335f0adbbace34593236cb84e849592e5971a797554d3605d323
    - af13b16416760782ec81d587736cb4c9b2e7099afc10cb764eeb4c922ee8802f
    - 66fc8b03bc0ab95928673e0ae7f06f34f17537caf159e178a452c2c56ba6dda7
    - 7158099406d99db82b7dc9f6418c1189ee472ce3c25a3612a5ec5672ee282dc0
    - d88c5695ccd83dce6729b84c8c43e8a804938a7ab7cfeccaa0699d6b1f81c95c
  condition: sha256
falsepositives:
  - Legitimate files that happen to have a hash collision with the indicators of compromise (highly unlikely).
  - Files from a legitimate software distribution that has been compromised and re-used by the malware (re-packaging attack).
level: critical
