# review_report_url: https://unit42.paloaltonetworks.com/threat-assessment-north-korean-threat-groups-2024/
# review_date: 2024-10-27
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This detection rule is designed to identify the presence of a specific file related to the KANDYKORN malware by monitoring for its SHA256 hash in Windows systems, particularly in image load events. The precision of using a SHA256 hash ensures that the detection is targeted and minimizes false positives, although the potential for legitimate files sharing the same hash cannot be completely ruled out. Given the high-risk nature of KANDYKORN, any alerts generated by this rule warrant immediate investigation. Security teams should be prepared to respond swiftly to any detections to mitigate potential threats effectively.
title: Detection of KANDYKORN Malicious File
id: 28b1822e-665a-4b1d-b7f9-81f246bb2cd6
status: experimental
description: Detects the presence of a file with a known malicious SHA256 hash associated with the KANDYKORN threat.
references:
  - https://unit42.paloaltonetworks.com/threat-assessment-north-korean-threat-groups-2024
author: System Two Security
date: 2024/09/13
tags:
  - attack.execution
logsource:
  product: windows
  category: image_load
detection:
  selection:
    sha256: 927b3564c1cf884d2a05e1d7bd24362ce8563a1e9b85be776190ab7f8af192f6
  condition: selection
falsepositives:
  - Unknown. Hashes are unique to files, and this hash is associated with a known threat. Any detection should be investigated.
level: high
