# review_report_url:https://www.cisa.gov/news-events/analysis-reports/ar21-148a
# review_date: 2024-09-21
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - The sigma rule effectively matches the CTI report for detecting the execution of the malicious LNK file (Report.lnk) that launches the Cobalt Strike implant (Documents.dll). Both the DLL hashes and the execution path match the threat activity outlined in the report, confirming the rule’s accuracy in detecting this behavior.
title: Cobalt Strike Implant Launch via Malicious LNK File
id: e2b303c2-650e-432d-a6ce-cc04859ec76d
status: experimental
description: Detects the execution of a malicious LNK file that launches a Cobalt Strike implant named "Documents.dll" with known bad hashes.
references:
  - https://www.cisa.gov/news-events/analysis-reports/ar21-148a
author: System Two Security
date: 2024/09/23
tags:
  - attack.execution
  - attack.t1027.012
logsource:
  product: windows
  category: image_load
detection:
  selection:
    ImageLoaded|endswith: Documents.dll
    Hashes|contains:
      - ee44c0692fd2ab2f01d17ca4b58ca6c7f79388cbc681f885bb17ec946514088c
      - ee42ddacbd202008bcc1312e548e1d9ac670dd3d86c999606a3a01d464a2a330
  condition: selection
falsepositives:
  - Legitimate applications using a DLL named Documents.dll with the same hash (unlikely)
level: high
