# review_author: Blackperl
# review_date: 2024-12-11
# review_report_url: https://www.trendmicro.com/en_us/research/24/i/earth-baxia-spear-phishing-and-geoserver-exploit.html
# review_rule_useful: Yes
# review_rule_classification: Proceed to testing
# review_rule_ttp_match: Yes
# review_notes: The rule effectively detects Earth Baxia's C2 activity by monitoring file downloads from static.krislab.site, a known malicious domain used for distributing Cobalt Strike beacon implants and other malicious payloads. By focusing on specific file names and command-line patterns (e.g., the use of wget), the rule targets suspicious downloads associated with Earth Baxia's attack techniques.

title: Earth Baxia Curl.exe Exfiltration Tool
id: 36fa017c-1b11-4ed2-88b3-b4cad5cbfa6e
status: experimental
description: Detects the presence of curl.exe used by Earth Baxia based on file hashes.
references:
  - https://www.trendmicro.com/en_us/research/24/i/earth-baxia-spear-phishing-and-geoserver-exploit.html
author: System Two Security
date: 2024/11/28
tags:
  - attack.exfiltration
logsource:
  product: windows
  category: image_load
detection:
  selection:
    Hashes|contains:
      - d528491282
      - c1b20e42b5be1d83d381222a35b44558
      - 20ca13dd17c
    Image: C:\Windows\Temp\curl.exe
  condition: selection
falsepositives:
  - Legitimate use of curl.exe with matching hashes (unlikely)
level: critical
