# review_report_url: https://unit42.paloaltonetworks.com/javascript-malware-gootloader/
# review_date: 2024-10-23
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This query is useful and correct based on the report. No fine-tuned or suggested query required.
title: Detection of GootLoader JavaScript Files by SHA256 Hash
id: 74679b74-99bb-4ee9-867c-728ef2a7bd43
status: experimental
description: Detects the presence of known GootLoader JavaScript files based on their SHA256 hashes.
references:
  - https://unit42.paloaltonetworks.com/javascript-malware-gootloader
author: System Two Security
date: 2024/10/11
tags:
  - attack.defense-evasion
logsource:
  product: windows
  category: image_load
detection:
  selection:
    ImageLoaded|endswith: .js
    sha256:
      - b939ec9447140804710f0ce2a7d33ec89f758ff8e7caab6ee38fe2446e3ac988
      - c853d91501111a873a027bd3b9b4dab9dd940e89fcfec51efbb6f0db0ba6687b
  condition: selection
falsepositives:
  - Legitimate JavaScript files with a matching hash due to hash collision (highly unlikely)
level: high
