# review_report_url: https://blog.sekoia.io/stealc-a-copycat-of-vidar-and-raccoon-infostealers-gaining-in-popularity-part-1
# review_date: 2024-12-03
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - The Sigma detects file creation, modification, or process execution events related to the Stealc infostealer by SHA256 hashes.
title: Detection of Stealc Infostealer SHA256 Hashes
id: 5756810b-847d-4573-9685-ad2f94a57412
status: experimental
description: Detects file creation, modification, or process execution events related to the Stealc infostealer by SHA256 hashes.
references:
  - https://blog.sekoia.io/stealc-a-copycat-of-vidar-and-raccoon-infostealers-gaining-in-popularity-part-1
author: System Two Security
date: 2024/11/15
tags:
  - attack.credential-access
logsource:
  product: windows
  category: image_load
detection:
  hashes:
    sha256|contains:
      - 77d6f1914af6caf909fa2a246fcec05f500f79dd56e5d0d466d55924695c702d
      - 87f18bd70353e44aa74d3c2fda27a2ae5dd6e7d238c3d875f6240283bc909ba6
      - 1e09d04c793205661d88d6993cb3e0ef5e5a37a8660f504c1d36b0d8562e63a2
  condition: hashes
falsepositives:
  - Legitimate software that happens to have the same hash as the malicious software
level: high
