# review_report_url: https://unit42.paloaltonetworks.com/snipbot-romcom-malware-variant
# review_date: 2024-09-21
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - As mentioned in the CTI report, the rule checks for the IOCs of malware from image load events. 
title: Detection of SnipBot Malware Variant via SHA256 Hashes
id: 8a1b1edd-4fc7-4846-a4ef-9b34eb11e3a4
status: experimental
description: Detects file creation or process execution related to the SnipBot malware variant by matching known SHA256 hashes.
references:
  - https://unit42.paloaltonetworks.com/snipbot-romcom-malware-variant
author: System Two Security
date: 2024/09/26
tags:
  - attack.persistence
logsource:
  product: windows
  category: image_load
detection:
  selection:
    sha256|contains:
      - 1cb4ff70f69c988196052eaacf438b1d453bbfb08392e1db3df97c82ed35c154
      - 5390ba094cf556f9d7bbb00f90c9ca9e04044847c3293d6e468cb0aaeb688129
      - 57e59b156a3ff2a3333075baef684f49c63069d296b3b036ced9ed781fd42312
      - 5c71601717bed14da74980ad554ad35d751691b2510653223c699e1f006195b8
      - 5b30a5b71ef795e07c91b7a43b3c1113894a82ddffc212a2fa71eebc078f5118
      - 2c327087b063e89c376fd84d48af7b855e686936765876da2433485d496cb3a4
      - 60d96087c35dadca805b9f0ad1e53b414bcd3341d25d36e0190f1b2bbfd66315
      - a2f2e88a5e2a3d81f4b130a2f93fb60b3de34550a7332895a084099d99a3d436
      - cfb1e3cc05d575b86db6c85267a52d8f1e6785b106797319a72dd6d19b4dc317
      - e5812860a92edca97a2a04a3151d1247c066ed29ae6bbcf327d713fbad7e79e8
      - f74ebf0506dc3aebc9ba6ca1e7460d9d84543d7dadb5e9912b86b843e8a5b671
      - 0be3116a3edc063283f3693591c388eec67801cdd140a90c4270679e01677501
      - 92c8b63b2dd31cf3ac6512f0da60dabd0ce179023ab68b8838e7dc16ef7e363d
      - b9677c50b20a1ed951962edcb593cce5f1ed9c742bc7bff827a6fc420202b045
  condition: selection
falsepositives:
  - Legitimate software that coincidentally has the same hash as the malware
level: high
