# review_report_url: https://cloud.google.com/blog/topics/threat-intelligence/apt41-arisen-from-dust/
# review_date: 2024-09-21
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This query is useful and correct based on the rule name and description. Howver, we can increase the fidelity of the sigma if we include rest of the IOCs as well. So this query doesn't require finetuning. You can check alternative sigma from rule ID: 92ffee8f-bc55-46e4-a846-6636fc95bf7a
title: Detection of DUSTTRAP Family Malware File Sbiedll.dll
id: 3f0b1c0f-971c-4e2e-a15c-109b1e1646f0
status: experimental
description: Detects the creation or execution of the file Sbiedll.dll with a specific MD5 hash associated with the DUSTTRAP family.
references:
  - https://cloud.google.com/blog/topics/threat-intelligence/apt41-arisen-from-dust
author: System Two Security
date: 2024/09/11
tags:
  - attack.defense-evasion
logsource:
  product: windows
  category: image_load
detection:
  selection:
    ImageLoaded|endswith: \Sbiedll.dll
    Hashes|contains: MD5=d72f202c1d684c9a19f075290a60920f
  condition: selection
falsepositives:
  - Unknown. Any match should be investigated.
level: high
