# review_report_url: https://www.microsoft.com/en-us/security/blog/2024/08/30/north-korean-threat-actor-citrine-sleet-exploiting-chromium-zero-day/
# review_date: 2024-09-22
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This rule detects interactions with known malicious domains associated with the Citrine Sleet threat actor by monitoring IIS logs for any occurrences of the domains "weinsteinfrog.com" and "voyagorclub.space" in the cs-host or cs-referer fields. Alerts triggered by this rule may indicate potential command-and-control activity or attempts to exploit compromised domains.
title: Interaction with Citrine Sleet Malicious Domains via W3CIISLog
id: 34c9e308-af23-4812-aa14-dcd27f78065e
status: experimental
description: Detects interaction with known Citrine Sleet malicious domains in W3CIISLog events.
references:
  - https://www.microsoft.com/en-us/security/blog/2024/08/30/north-korean-threat-actor-citrine-sleet-exploiting-chromium-zero-day
author: System Two Security
date: 2024/09/27
tags:
  - attack.command-and-control
logsource:
  product: windows
  service: iis
detection:
  cs-host_or_cs-referer_contains_malicious_domain:
    cs-host|contains:
      - voyagorclub.space
      - weinsteinfrog.com
    cs-referer|contains:
      - voyagorclub.space
      - weinsteinfrog.com
  condition: cs-host_or_cs-referer_contains_malicious_domain
falsepositives:
  - Legitimate access to a domain that has been compromised but is also used for non-malicious purposes.
level: high
