# review_report_url: https://www.cybereason.com/blog/research/back-to-the-future-inside-the-kimsuky-kgh-spyware-suite
# review_date: 2024-10-16
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This rule monitors for network traffic directed to known Kimsuky KGH spyware C2 domains such as "myaccounts.posadadesantiago.com" and "csv.posadadesantiago.com." By focusing on specific domain names, it helps detect C2 communication associated with KGH spyware campaigns. False positives may arise if these domains are used for legitimate purposes after being compromised, requiring thorough validation.

title: Kimsuky KGH Spyware Suite C2 Domain Communication
id: bfde9828-7d41-4841-98cf-993b16b47445
status: experimental
description: Detects network traffic to known Kimsuky KGH spyware command and control domains.
references:
  - https://www.cybereason.com/blog/research/back-to-the-future-inside-the-kimsuky-kgh-spyware-suite
author: System Two Security
date: 2024/10/11
tags:
  - attack.command-and-control
logsource:
  product: zeek
  service: http
detection:
  c2_traffic:
    uri|contains:
      - myaccounts.posadadesantiago.com
      - csv.posadadesantiago.com
      - www.eventosatitlan.com
      - wave.posadadesantiago.com
  condition: c2_traffic
falsepositives:
  - Legitimate traffic to domains that have been compromised and are also used for benign purposes.
level: high
