# review_report_url: https://www.sentinelone.com/labs/kimsuky-new-social-engineering-campaign-aims-to-steal-credentials-and-gather-strategic-intelligence/
# review_date: 2024-10-17
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This Sigma rule perfectly aligns with the CTI report’s indicators. The rule accurately captures the malicious activity associated with the Kimsuky campaign’s phishing operation, where adversaries impersonate NK News to steal credentials. This rule provides strong detection coverage for any network traffic targeting this credential theft endpoint, making it highly effective in identifying a key phase of the Kimsuky campaign.
title: Kimsuky Campaign - NK News Credential Theft Endpoint Detection
id: 69117bc4-5c77-4aef-8013-e40e0130514c
status: experimental
description: Detects access to a known NK News credential theft endpoint used by Kimsuky campaign.
references:
  - https://www.sentinelone.com/labs/kimsuky-new-social-engineering-campaign-aims-to-steal-credentials-and-gather-strategic-intelligence
author: System Two Security
date: 2024/10/11
tags:
  - attack.credential-access
logsource:
  product: zeek
  service: http
detection:
  selection:
    uri|contains: /ip/register/login.php
  filter1:
    client_header_names|contains: Host
    uri|contains: www.nknews.pro
  condition: selection and filter1
falsepositives:
  - Legitimate access to a similarly named endpoint that is not part of the NK News domain.
level: high
