# review_report_url: URL
# review_date: 2024-09-19
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - The sigma rule aligns well with the behavior described in the CTI report, specifically detecting the creation of the "ESX Admins" group associated with the exploitation of CVE-2024-73085. Although the exact commands are not mentioned in the CTI report, the event itself is documented. Based on this, the rule is ready to proceed to testing to verify its effectiveness in detecting this specific activity in real-world scenarios.S
title: 'Black Basta Ransomware: Creation of "ESX Admins" Group Indicative of CVE-2024-73085 Exploitation'
id: 8876e44e-9834-4c3a-8136-8e63ea52619b
status: experimental
description: Detects the creation of a new group named "ESX Admins" which may indicate exploitation of CVE-2024-73085 as part of a ransomware attack targeting ESXi hypervisors.
references:
  - https://www.microsoft.com/en-us/security/blog/2024/07/29/ransomware-operators-exploit-esxi-hypervisor-vulnerability-for-mass-encryption
author: System Two Security
date: 2024/09/18
tags:
  - attack.persistence
logsource:
  product: linux
  service: auditd
detection:
  keywords:
    - groupadd ESX Admins
    - usermod -aG ESX Admins
  condition: keywords
falsepositives:
  - Legitimate creation of a group named "ESX Admins" by system administrators
level: high
