# review_report_url: https://redcanary.com/blog/threat-detection/email-forwarding-rules
# review_date: 2024-11-18
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This Sigma rule detects suspicious usage of the Connect-ExchangeOnline PowerShell command in conjunction with actions such as Set-Mailbox and New-InboxRule, which could indicate unauthorized access to a compromised Microsoft 365 account. These commands are often used by adversaries to establish email forwarding rules or modify mailbox configurations for data exfiltration.By targeting successful executions (status: Succeeded) of these PowerShell commands, the rule effectively identifies potential abuse of Exchange Online Management cmdlets. 

title: Detection of Connect-ExchangeOnline PowerShell Command
id: 43839d16-6042-468f-9511-3bd958a8794b
status: experimental
description: Detects the use of the Connect-ExchangeOnline PowerShell command with the -UserPrincipalName parameter, which could indicate an adversary accessing a compromised account.
references:
  - https://redcanary.com/blog/threat-detection/email-forwarding-rules
author: System Two Security
date: 2024/11/26
tags:
  - attack.exfiltration
logsource:
  service: exchange
  product: m365
detection:
  selection:
    eventName:
      - Set-Mailbox
      - New-InboxRule
    eventSource: PowerShell
    status: Succeeded
  condition: selection
falsepositives:
  - Legitimate administrative activities that use the Connect-ExchangeOnline command.
level: high
