# review_author: Blackperl
# review_date: 2024-12-11
# review_report_url: https://www.microsoft.com/en-us/security/blog/2023/10/25/octo-tempest-crosses-boundaries-to-facilitate-extortion-encryption-and-destruction
# review_rule_useful: Yes
# review_rule_classification: Proceed to testing
# review_rule_ttp_match: Yes
# review_notes: This detection rule identifies the creation or modification of mail forwarding rules in Microsoft 365, which may indicate an account compromise or exfiltration attempt. While legitimate user actions can trigger this detection, unauthorized or unexpected rule changes should be investigated promptly. Regular auditing of mail configurations and enforcing strong account security can help mitigate the risk of data exfiltration through email.

title: Office Mail Forwarding
id: d23175d5-bbed-484a-b4a0-2dbe174f7a19
status: experimental
description: Detects the creation of mail forwarding rules, which can be an indicator of compromise.
references:
  - https://www.microsoft.com/en-us/security/blog/2023/10/25/octo-tempest-crosses-boundaries-to-facilitate-extortion-encryption-and-destruction
author: System Two Security
date: 2024/11/28
tags:
  - attack.exfiltration
  - attack.t1114.003
logsource:
  product: m365
  service: audit
detection:
  selection:
    Operation:
      - Set-Mailbox
      - New-InboxRule
      - Set-InboxRule
  condition: selection
falsepositives:
  - Legitimate mail forwarding configurations by users.
level: medium
