# review_author: Blackperl
# review_date: 2024-12-11
# review_report_url: https://harfanglab.io/insidethelab/compromised-routers-infrastructure-target-europe-caucasus
# review_rule_useful: Yes
# review_rule_classification: Proceed to testing
# review_rule_ttp_match: Yes
# review_notes: This Sigma rule is designed to detect malicious WebDAV activity by monitoring outbound network connections to specific IP addresses associated with WebDAV C2 infrastructure. The rule flags connections to 124.168.91.178 and 194.126.178.8, which are identified in threat intelligence reports as linked to malicious activities.

title: Suspicious WebDAV Connections - Threat Hunting
id: 1bbca883-13d2-4b9b-a407-6a897e65c48d
status: experimental
description: Detects outbound connections to IP addresses associated with malicious WebDAV activity.
references:
  - https://harfanglab.io/insidethelab/compromised-routers-infrastructure-target-europe-caucasus
author: System Two Security
date: 2024/11/28
tags:
  - attack.command-and-control
logsource:
  product: windows
  category: network_connection
detection:
  selection:
    DestinationIp:
      - 124.168.91.178
      - 194.126.178.8
  condition: selection
falsepositives:
  - Legitimate connections to these IP addresses if they are used for other purposes.
level: medium
