# review_author: Blackperl
# review_date: 2024-12-11
# review_report_url: https://cloud.google.com/blog/topics/threat-intelligence/apt41-initiates-global-intrusion-campaign-using-multiple-exploits
# review_rule_useful: Yes
# review_rule_classification: Proceed to testing
# review_rule_ttp_match: Yes
# review_notes: The rule effectively detects activity associated with the specific hostname exchange.dumb1.com as referenced in the CTI report.

title: Suspicious Connection to exchange.dumb1.com (CVE-2020-10189)
id: a75695c5-9f61-4133-915e-c09bada9c486
status: experimental
description: Detects network connections to exchange.dumb1.com, potentially related to CVE-2020-10189 exploitation attempts.
references:
  - https://cloud.google.com/blog/topics/threat-intelligence/apt41-initiates-global-intrusion-campaign-using-multiple-exploits
author: System Two Security
date: 2024/11/28
tags:
  - attack.initial-access
logsource:
  product: windows
  category: network_connection
detection:
  selection:
    DestinationHostname: exchange.dumb1.com
  condition: selection
falsepositives:
  - Legitimate connections to exchange.dumb1.com (if any)
level: medium
