# review_author: Blackperl
# review_date: 2024-12-11
# review_report_url: https://www.picussecurity.com/resource/blog/ttps-hafnium-microsoft-exchange-servers
# review_rule_useful: Yes
# review_rule_classification: Proceed to testing
# review_rule_ttp_match: Yes
# review_notes: This rule detects PowerShell scripts creating TCP connections

title: TCP Connection Creating via PowerShell Script
id: 9a1617ea-1a5b-4568-b92f-96aadb324b61
status: experimental
description: Detects PowerShell scripts creating TCP connections
references:
  - https://www.picussecurity.com/resource/blog/ttps-hafnium-microsoft-exchange-servers
author: System Two Security
date: 2024/11/28
tags:
  - attack.command-and-control
  - attack.t1059.001
logsource:
  category: network_connection
  product: windows
detection:
  selection:
    Image|endswith:
      - \powershell.exe
      - \pwsh.exe
    Initiated: true
  condition: selection
falsepositives:
  - Legitimate PowerShell scripts making network connections
level: medium
