# review_report_url: https://blog.sekoia.io/stealc-a-copycat-of-vidar-and-raccoon-infostealers-gaining-in-popularity-part-1
# review_date: 2024-12-03
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This rule detects attempts to download DLL files (e.g., nss3.dll, mozglue.dll) from known Stealc C2 URLs via network connections on port 80, potentially indicating infostealer malware activity. False positives may arise from legitimate software or administrative tools downloading updates or components from the internet, which coincidentally match the listed IoC patterns.
title: Stealc DLL File Requests
id: 5ef82250-8eab-4074-8462-c92db6150048
status: experimental
description: Detects network connection attempts to download DLL files from known Stealc C2 URLs, which may indicate an infostealer malware infection.
references:
  - https://blog.sekoia.io/stealc-a-copycat-of-vidar-and-raccoon-infostealers-gaining-in-popularity-part-1
author: System Two Security
date: 2024/11/15
tags:
  - attack.command-and-control
  - attack.t1574.001
logsource:
  product: windows
  category: network_connection
detection:
  selection1:
    DestinationHostname|contains:
      - 176.124.192.200
      - moneylandry.com
      - 162.0.238.10
      - fff-ttt.com
      - 23.88.116.117
      - aa-cj.com
      - 5.75.138.201
      - 94.142.138.48
      - 146.70.161.51
      - 179.43.162.2
      - 185.5.248.95
      - 666palm.com
      - 185.247.184.7
      - 95.216.112.83
      - 777palm.com
  selection2:
    DestinationPort|endswith: '80'
  selection3:
    Image|endswith:
      - nss3.dll
      - softokn3.dll
      - freebl3.dll
      - mozglue.dll
      - vcruntime140.dll
      - sqlite3.dll
      - msvcp140.dll
  condition: selection1 and selection2 and selection3
falsepositives:
  - Legitimate software or administrative tools downloading updates or components from the internet that coincidentally match the IoC patterns.
level: high
