# review_report_url: https://securityintelligence.com/x-force/ex-conti-fin7-actors-collaborate-new-backdoor
# review_date: 2024-10-18
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - The sigma rule for detecting network connections to Nemesis malware C2 domains serves as an essential tool in the arsenal of cybersecurity professionals. By identifying these connections, organizations can take proactive measures to detect and remediate infections before they lead to significant data breaches or system compromises.
title: Detect Nemesis Malware C2 Network Connection
id: 0f369eeb-6dbf-4eaa-8f30-2f7cc438e81c
status: experimental
description: Detects network connections to a known Nemesis malware command and control (C2) domain.
references:
  - https://securityintelligence.com/x-force/ex-conti-fin7-actors-collaborate-new-backdoor
author: System Two Security
date: 2024/10/11
tags:
  - attack.command-and-control
  - attack.t1568
logsource:
  product: windows
  category: network_connection
detection:
  c2_network_connection:
    DestinationHostname|contains: es-megadom.com
  condition: c2_network_connection
falsepositives:
  - Legitimate connections to the domain, if the domain is hijacked or reused for legitimate purposes after the report.
level: high
