# review_report_url: https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/certutil
# review_date: 2024-11-05
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - The sigma rule aligns accurately with the behavior detailed in the CTI report. The report confirms that DarkSide ransomware uses certutil.exe to download payloads from external servers, supporting the rule’s intent to detect such network activity. This rule is essential for identifying potential ransomware download actions and provides early warning signs of an attack.
title: Connection Initiated Via Certutil.EXE
id: 0dba975d-a193-4ed1-a067-424df57570d1
status: test
description: |
    Detects a network connection initiated by the certutil.exe utility.
    Attackers can abuse the utility in order to download malware or additional payloads.
references:
    - https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/certutil
author: frack113, Florian Roth (Nextron Systems)
date: 2022/09/02
modified: 2022/10/04
tags:
    - attack.command_and_control
    - attack.t1105
logsource:
    category: network_connection
    product: windows
detection:
    selection:
        Image|endswith: '\certutil.exe'
        Initiated: 'true'
        DestinationPort:
            - 80
            - 135
            - 443
            - 445
    condition: selection
falsepositives:
    - Unknown
level: high
