# review_report_url: https://unit42.paloaltonetworks.com/threat-assessment-north-korean-threat-groups-2024/
# review_date: 2024-10-27
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - This detection rule identifies DNS queries to domains known to be associated with the North Korean threat group POOLRAT, specifically targeting "globalkeystroke.com" and "airbseeker.com." The rule utilizes Zeek logs to capture DNS traffic and flags any matching queries as high-risk. However, there is a possibility of false positives from legitimate access to compromised or spoofed domains, necessitating further investigation.
title: Detection of Malicious Domain Communication Related to North Korean Threat Group POOLRAT
id: ffcef4ef-2aba-4b49-a3df-cfa68a828aca
status: experimental
description: Detects DNS queries to known malicious domains associated with North Korean threat group POOLRAT.
references:
  - https://unit42.paloaltonetworks.com/threat-assessment-north-korean-threat-groups-2024
author: System Two Security
date: 2024/09/13
tags:
  - attack.command-and-control
logsource:
  product: zeek
  service: dns
detection:
  selection:
    query|contains:
      - globalkeystroke[.]com
      - airbseeker[.]com
  condition: selection
falsepositives:
  - Legitimate access to domains that have been compromised or spoofed by threat actors.
level: high
