# review_author: Blackperl
# review_date: 2024-12-11
# review_report_url: https://www.microsoft.com/en-us/security/blog/2023/10/25/octo-tempest-crosses-boundaries-to-facilitate-extortion-encryption-and-destruction
# review_rule_useful: Yes
# review_rule_classification: Proceed to testing
# review_rule_ttp_match: Yes
# review_notes: This detection rule monitors Okta user password reset events, which may indicate potential unauthorized access attempts or suspicious account activity. While legitimate user-initiated resets can trigger false positives, unexpected or frequent resets should be investigated to rule out malicious activity. Regular auditing of password reset events and enforcing strong authentication measures can help mitigate unauthorized access risks.

title: Okta User Password Reset
id: b38e0671-df97-4f56-be67-84cf80234f6a
status: experimental
description: Detects an Okta user password reset event.
references:
  - https://www.microsoft.com/en-us/security/blog/2023/10/25/octo-tempest-crosses-boundaries-to-facilitate-extortion-encryption-and-destruction
author: System Two Security
date: 2024/11/28
tags:
  - attack.initial-access
logsource:
  product: okta
  service: okta
detection:
  selection:
    eventtype: user.account.reset_password
  condition: selection
falsepositives:
  - Legitimate password resets by users
level: medium
