# review_author: Blackperl
# review_date: 2024-12-11
# review_report_url: https://unit42.paloaltonetworks.com/muddled-libra-evolution-to-cloud
# review_rule_useful: Yes
# review_rule_classification: Proceed to testing
# review_rule_ttp_match: Yes
# review_notes: This Sigma rule identifies the creation of a new identity provider in Okta with impersonation privileges, which could signal malicious intent. Security teams should investigate to ensure the action is legitimate and aligns with administrative policies.

title: Okta - Addition of New Identity Provider with Impersonation Privileges
id: c831cbd9-b135-4a3a-8560-7049f65d6a8a
status: experimental
description: Detects the addition of a new identity provider in Okta with impersonation privileges, potentially indicating malicious activity.
references:
  - https://unit42.paloaltonetworks.com/muddled-libra-evolution-to-cloud
author: System Two Security
date: 2024/11/29
tags:
  - attack.credential-access
logsource:
  product: okta
  service: okta
detection:
  selection:
    eventtype: identity.provider.create
    outcome.result: SUCCESS
  condition: selection and impersonation_privilege
  impersonation_privilege:
    target.displayname|contains: impersonation
falsepositives:
  - Legitimate creation of identity providers with impersonation privileges by administrators.
level: medium
