# review_author: Blackperl
# review_date: 2024-12-11
# review_report_url: https://unit42.paloaltonetworks.com/muddled-libra-evolution-to-cloud
# review_rule_useful: Yes
# review_rule_classification: Proceed to testing
# review_rule_ttp_match: Yes
# review_notes: This Sigma rule detects successful logins to the Okta Identity Portal using compromised technology administrator accounts, potentially linked to Muddled Libra activity. Security teams should investigate unusual login patterns to confirm legitimacy.

title: Muddled Libra - Access to Okta Identity Portal via Compromised Admin Account
id: e2ee47c5-aeae-4e1a-bb90-cad421f9f6b4
status: experimental
description: Detects successful logins to Okta Identity Portal using compromised technology administrator accounts, indicative of Muddled Libra activity.
references:
  - https://unit42.paloaltonetworks.com/muddled-libra-evolution-to-cloud
author: System Two Security
date: 2024/11/29
tags:
  - attack.credential-access
logsource:
  product: okta
  service: okta
detection:
  selection:
    eventtype: user.session.start
    outcome.result: SUCCESS
    target.displayname: Okta Identity Portal
  condition: selection
falsepositives:
  - Legitimate logins from technology administrators
level: medium
