# review_report_url: https://blogs.blackberry.com/en/2024/04/fin7-targets-the-united-states-automotive-industry
# review_date: 2024-10-18
# review_author: Blackpearl
# review_rule_useful: true
# review_rule_classification: proceed to testing
# review_rule_classification_reason: na
# review_rule_ttp_match: yes
# review_notes:
#  - The provided IoCs detail detection rules used by SentinelOne to identify malicious activities associated with the FIN7 threat group, including their use of SSH backdoors, command and control (C2) implant behaviors, and obfuscation techniques.
title: Potential POWERTRASH Script Execution
id: 4e19528a-f081-40dd-be09-90c39352bd64
status: test
description: Detects potential execution of the PowerShell script POWERTRASH
references:
    - https://labs.withsecure.com/publications/fin7-target-veeam-servers
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-05-04
tags:
    - attack.execution
    - attack.t1059.001
    - attack.g0046
    - detection.emerging-threats
logsource:
    product: windows
    category: ps_script
    definition: bade5735-5ab0-4aa7-a642-a11be0e40872
detection:
    selection:
        ScriptBlockText|contains|all:
            - 'IO.Compression.DeflateStream'
            - 'IO.MemoryStream'
            - '::FromBase64String'
            - 'GetDelegateForFunctionPointer'
            - '.Invoke()'
            - 'GlobalAssemblyCache'
    condition: selection
falsepositives:
    - Unknown
level: high
